[
  {
    "img_id": "t3_1jy5hod",
    "text": "Somewhere in the Far East",
    "label": "humor",
    "description": "Image Type and Style: This is a meme-style humorous image.\n\nStyle Preference: The style is satirical and funny.\n\nCore Text Content: The prominent phrase is \"I'm not crazy about the feng shui,\" conveying a humorous critique.\n\nMain Message (Intention): This image wants to tell us that sometimes traditional concepts like feng shui can be humorously impractical.\n\nVisual Elements: The background features a mountain scenery with a cliff and a large rock precariously perched above a traditional Asian building. There are two small figures, possibly people, looking at the scene. Their expressions are not clearly visible."
  },
  {
    "img_id": "t3_1jsshgu",
    "text": "I'm the only one?",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: \"So, I'm the only one who sees a conflict of interest here?\"\n\nMain Message (Intention): This image wants to humorously criticize the absurdity of a situation where a shark is the lifeguard.\n\nVisual Elements: The background features a beach setting with a lifeguard tower. There is a shark on the lifeguard chair, wearing sunglasses. People are present, with one person lying on the beach and another sitting beside them, both appearing relaxed. The shark's presence is the humorous focal point."
  },
  {
    "img_id": "t3_1jplzg4",
    "text": "Negotiation",
    "label": "humor",
    "description": "Image Type and Style: This is a meme-style humorous image.\n\nStyle Preference: It leans towards a satirical and funny style.\n\nCore Text Content: The prominent text is, \"Walter? Tim here. Right...yeah. We got your offer and I'm putting together our response right now.\"\n\nMain Message (Intention): This image wants to tell us that office work can be humorously chaotic and inefficient.\n\nVisual Elements: The background is an office setting. There is one person, a man, sitting on a photocopier with a phone, appearing to be multitasking. There are office objects like a photocopier and papers."
  },
  {
    "img_id": "t3_1jlnuy8",
    "text": "4k monitor and 3k monitor",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical and funny.\n\nCore Text Content: The prominent text is \"4K monitor\" and \"3K monitor,\" humorously comparing the two.\n\nMain Message (Intention): This image wants to tell us that the concept of a \"3K monitor\" is absurd, humorously illustrating it as a monitor with two circular views.\n\nVisual Elements: The background shows two monitors; the left displays a clear landscape with mountains and a lake, while the right shows the same image through two circular cutouts. There are no people or additional objects."
  },
  {
    "img_id": "t3_1imc3bl",
    "text": "I like this meme",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical and dark humor.\n\nCore Text Content: \"WHAT'S THE BEST GAME TO PLAY IN NEW YORK CITY? GIANT JENGA\" conveys a satirical and controversial point of view.\n\nMain Message (Intention): This image wants to tell us that it humorously criticizes or makes light of a tragic historical event using dark humor.\n\nVisual Elements: The background features the Twin Towers during the 9/11 attacks, engulfed in flames and smoke. There are no people visible, and the focus is on the buildings themselves."
  },
  {
    "img_id": "t3_1i8kq3f",
    "text": "bruh I thought we were past this 🫤🫤",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\nStyle Preference: Funny, minimalist.\nCore Text Content: The most prominent text is \"COLORS,\" circled in red, suggesting a humorous emphasis.\nMain Message (Intention): This image wants to tell us that laundry settings can be amusingly highlighted or misunderstood.\nVisual Elements: The background is a close-up of a washing machine dial with various settings. There are no people or additional objects present."
  },
  {
    "img_id": "t3_1i4i4av",
    "text": "Jackpott",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"How parachute companies feel after realizing that it's impossible for them to get bad reviews.\"\n\nMain Message (Intention): This image wants to tell us that parachute companies are humorously immune to bad reviews due to the nature of their product.\n\nVisual Elements: The background features a cartoon character, Bugs Bunny, dressed as a king, sitting on a throne with a smug expression. There are no other people or objects present."
  },
  {
    "img_id": "t3_1i14lwo",
    "text": "Bonita",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"If anyone could please help make this picture more headshot worthy I would be so so grateful 🙏 thank you in advance 🥰🥰\"\n\nMain Message (Intention): This image wants to tell us that humor can be found in unexpected photo edits, playfully critiquing the request for a professional headshot.\n\nVisual Elements: The background includes a car scene with people sitting inside. There are no visible expressions due to blurred faces. The setting suggests a casual, humorous context."
  },
  {
    "img_id": "t3_1hxd7by",
    "text": "Nice",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\nStyle Preference: Funny, minimalist.\nCore Text Content: The prominent text is \"ice\" and \"nice,\" playing on the visual similarity and wordplay.\nMain Message (Intention): This image wants to tell us that humor can be found in simple wordplay and visual puns.\nVisual Elements: The background is plain, divided into two sections. On the left, there are ice cubes; on the right, there are black cubes resembling charcoal. There are no people or additional objects."
  },
  {
    "img_id": "t3_1hgjdbx",
    "text": "It’s true though",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: \"Nobody: Average water in Africa.\" The text conveys a critique of water quality in Africa, using humor and exaggeration.\n\nMain Message (Intention): This image wants to tell us that water quality in Africa is often poor, using humor to highlight the issue.\n\nVisual Elements: The background shows an indoor setting with a floor and door. There are no people visible, but a hand is holding a cup filled with murky water. The expression of the hand is not visible. The main object is the cup of water."
  },
  {
    "img_id": "t3_1h5qtr4",
    "text": "Relatible",
    "label": "humor",
    "description": "Image Type and Style: This is a meme-style humorous image, presented as a social media screenshot.\n\nStyle Preference: The style is satirical, using humor to critique a serious topic.\n\nCore Text Content: The most prominent phrase is \"Make War Consequential Again,\" which conveys a critique of war and its impact, using irony.\n\nMain Message (Intention): This image wants to tell us that war has significant consequences, and it uses satire to highlight the gravity of the situation.\n\nVisual Elements: The background features a LEGO box labeled \"GAZA,\" filled with gray bricks. There are no people, but the box design mimics a LEGO set, suggesting construction or destruction."
  },
  {
    "img_id": "t3_1gx5g9z",
    "text": "European shopping center",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: \"Current European shopping malls\" and \"16th-century European shopping centers.\"\n\nMain Message (Intention): This image wants to tell us that European colonialism exploited African resources, humorously critiquing historical economic practices.\n\nVisual Elements: The background features a modern shopping mall with escalators and people shopping. Below, a silhouette of the African continent is shown. There are people in the mall, casually shopping, with no specific expressions highlighted. No additional objects are prominently featured."
  },
  {
    "img_id": "t3_1gso39m",
    "text": "The shooting qualification standards for U.S. police officers.",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\nStyle Preference: Satirical.\nCore Text Content: \"The shooting qualification standards for U.S. police officers.\"\nMain Message (Intention): This image wants to tell us that it humorously criticizes the perceived low shooting accuracy standards for U.S. police officers.\nVisual Elements: The background features a shooting target with bullet holes scattered outside the bullseye. There are no people present. The target is the main object."
  },
  {
    "img_id": "t3_1g4sa8m",
    "text": "Not his day, I guess",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny, satirical.\n\nCore Text Content: \"WELL, FUCK\" conveys a tone of humorous resignation or acceptance of an unexpected situation.\n\nMain Message (Intention): This image wants to tell us that sometimes we find ourselves in situations where we just have to accept the absurdity or inevitability of circumstances.\n\nVisual Elements: The background is underwater. There is a person submerged, with only their head and shoulders above water, looking upwards with a neutral expression. No other objects are present."
  },
  {
    "img_id": "t3_1fzbtmb",
    "text": "I'm only a little colorblind myself :)",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and minimalist.\n\nCore Text Content: \"Roses are GRAY, Violets are GRAY, Everything's GRAY, I'm a DOG.\"\n\nMain Message (Intention): This image wants to humorously convey the perspective of a dog, highlighting how dogs see the world in shades of gray.\n\nVisual Elements: The background is plain black. There is a cartoonish drawing of a dog's face with a neutral expression. No other objects or people are present."
  },
  {
    "img_id": "t3_1fyfdbs",
    "text": "The state i found bro in after he said “relax she just likes hello kitty”",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\nStyle Preference: Funny and satirical.\nCore Text Content: The image does not contain any text.\nMain Message (Intention): This image wants to humorously depict a cartoon character in an urban setting with a fire, possibly poking fun at chaotic or unexpected situations.\nVisual Elements: The background features a dark, urban alleyway with dim lighting. There is a cartoon character with a blue hat, looking at a fire on the ground. The character has a neutral expression, and the fire is the only prominent object."
  },
  {
    "img_id": "t3_1fvvw24",
    "text": "O.o",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"THE COOKIES ARE READY WHEN THE BABY STOPS SCREAMING.\"\n\nMain Message (Intention): This image wants to tell us that humor can be found in the chaos of parenting.\n\nVisual Elements: The background shows a car windshield with a baking tray full of cookies. There are no visible people or objects other than the cookies and the car."
  },
  {
    "img_id": "t3_1frhuma",
    "text": ".",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"Real men grill vegetables not dead animals.\"\n\nMain Message (Intention): This image wants to humorously critique traditional masculinity and dietary choices.\n\nVisual Elements: The background includes a barbecue grill filled with vegetables, a person grilling, and a humorous comment below the main text. There are no visible expressions due to the blurred face."
  },
  {
    "img_id": "t3_1froxxh",
    "text": "the doomer mindset",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"I lost my job, my house, my family and my car\" and \"I never had any of those.\"\n\nMain Message (Intention): This image wants to tell us that different perspectives can lead to contrasting reactions to similar situations, often humorously highlighting resilience or indifference.\n\nVisual Elements: The background is plain white. There are two dogs depicted: one appears sad and is sitting, while the other is muscular and standing confidently. No additional objects are present."
  },
  {
    "img_id": "t3_1fq90eo",
    "text": "When the teacher eats up the bullshit excuse you gave her for not doing your homework",
    "label": "humor",
    "description": "Image Type and Style: The image is a courtroom scene, likely from a documentary or news coverage, with a formal and serious style.\n\nStyle Preference: The style leans towards formal and serious, capturing a significant moment in a legal setting.\n\nCore Text Content: There is no prominent text or quote in the image.\n\nMain Message (Intention): This image wants to tell us that it captures a pivotal moment in a legal proceeding, possibly highlighting a dramatic or crucial point in a trial.\n\nVisual Elements: The background shows a crowded courtroom with people seated and standing. There are no visible objects like books or phones. The focus is on a person in a suit with raised hands, possibly demonstrating or emphasizing a point."
  },
  {
    "img_id": "t3_1fq8yvd",
    "text": "When you 3 questions deep in a science test and you hear gunshots from the hallways",
    "label": "humor",
    "description": "Image Type and Style: The image is a minimalist design with a focus on simplicity and elegance.\n\nStyle Preference: It leans towards a minimalist and modern style.\n\nCore Text Content: The core text content is not visible due to the blurred area.\n\nMain Message (Intention): This image wants to tell us that simplicity and focus can create a strong visual impact.\n\nVisual Elements: The background is a plain, dark color with a spotlight effect. There is a teal balloon as the central object. There are no people or additional objects visible."
  },
  {
    "img_id": "t3_1fmjbiv",
    "text": "My Life Right Now.",
    "label": "humor",
    "description": "Image Type and Style: The image is a social media screenshot, resembling a humorous meme-style image.\n\nStyle Preference: It leans towards a satirical and funny style.\n\nCore Text Content: The most prominent text is \"No Data,\" which humorously suggests a lack of activity or information.\n\nMain Message (Intention): This image wants to tell us that there is humor in acknowledging a lack of sexual activity, possibly poking fun at personal or societal expectations.\n\nVisual Elements: The background is a digital interface resembling a data tracking app. There are no people or objects present, only text and graphical elements typical of a smartphone screen."
  },
  {
    "img_id": "t3_1f4a0r9",
    "text": "Unfortunate roadside memorial arrangement",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: \"feel bad for laughing, feel worse for taking a photo, but here we are and there it goes.\"\n\nMain Message (Intention): This image wants to tell us that sometimes we find humor in unexpected or inappropriate situations, acknowledging the irony.\n\nVisual Elements: The background features a grassy area with two white crosses and floral wreaths, suggesting a memorial site. There are no people present."
  },
  {
    "img_id": "t3_1f41j0x",
    "text": "When your friends are so used to dark humour they think your cries for help are jokes",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\nStyle Preference: Funny, satirical.\nCore Text Content: \"I'm in danger.\"\nMain Message (Intention): This image humorously criticizes a situation where someone realizes they are in trouble but finds it amusing.\nVisual Elements: Background elements include the interior of a bus. There is one person, a cartoon character from \"The Simpsons,\" sitting on a bus seat with a nervous smile. No additional objects are present."
  },
  {
    "img_id": "t3_1e61prj",
    "text": "Instagram is wild...",
    "label": "humor",
    "description": "Image Type and Style:\nThis is a social media screenshot.\n\nStyle Preference:\nIt leans towards satirical and humorous.\n\nCore Text Content:\nThe most prominent sentence is: \"also her outfit colours [this is probably a coincidence but considering the fact that gwen is trans canonically i like to imagine they did this on purpose]\".\n\nMain Message (Intention):\nThis image wants to humorously suggest that the character's outfit colors were intentionally chosen to represent the trans flag.\n\nVisual Elements:\nBackground elements include social media interface elements. There are no people directly visible, but there are images of Spider-Gwen and Spider-Man. Spider-Gwen's outfit and the trans flag are prominent, and Spider-Man is shown with a Nazi symbol."
  },
  {
    "img_id": "t3_1e4c5fh",
    "text": "KFC trap",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical and funny.\n\nCore Text Content: The image does not contain any prominent text or quote.\n\nMain Message (Intention): This image wants to tell us that fast food can be humorously likened to a trap, suggesting it is irresistible or potentially unhealthy.\n\nVisual Elements: The background is a concrete surface. There is a large mousetrap with a bucket of fried chicken as bait. No people are present. The main object is the mousetrap with the chicken bucket."
  },
  {
    "img_id": "t3_1e2cgl6",
    "text": "*Raff out roud*",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: \"Why LOVE one but EAT the other?\" and \"I don't get it.\"\n\nMain Message (Intention): This image wants to tell us that it humorously critiques the inconsistency in how people treat different animals.\n\nVisual Elements: The background features a dog and a pig at the top, and a person with a confused expression at the bottom. There are no additional objects."
  },
  {
    "img_id": "t3_1dv964k",
    "text": "Guess they were tired of life in the fast lane",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: \"Oh dear Lord no! There had to have been another way!\" This phrase conveys a humorous critique of a situation, suggesting disbelief or regret.\n\nMain Message (Intention): This image wants to tell us that sometimes solutions can be absurd or impractical, humorously criticizing the lack of foresight.\n\nVisual Elements: The background features a simple drawing of a tree with a tire swing. There are no people, but the tire on the ground and the broken stool suggest a failed attempt at using the swing."
  },
  {
    "img_id": "t3_1du0bia",
    "text": "Would you guys watch it?",
    "label": "humor",
    "description": "Image Type and Style: Promotional poster; minimalist and dark.\nStyle Preference: Leans towards a formal and intense style.\nCore Text Content: \"ALIEN vs. PREDATOR\" suggests a confrontation or battle theme.\nMain Message (Intention): This image wants to tell us that an epic showdown between two iconic characters is being promoted.\nVisual Elements: The background is dark with a subtle glow, featuring a partial view of a head. There are no visible people or objects."
  },
  {
    "img_id": "t3_1dsajth",
    "text": "Saw this on yt, figured I’d post it, feel free to upvote if you get the joke",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny, satirical.\n\nCore Text Content: \"I have 5 more players to unlock.\"\n\nMain Message (Intention): This image wants to tell us that the team is incomplete, humorously likening it to a video game where players need to be unlocked.\n\nVisual Elements: The background is a plain wall with a faint logo or text. There are people (yes), a basketball team posing for a group photo. They are standing in a line, wearing uniforms, with neutral expressions. No additional objects are present."
  },
  {
    "img_id": "t3_1dr46ou",
    "text": "Scanned my arm at big W today, came up with this.",
    "label": "humor",
    "description": "Image Type and Style: The image is a digital display, likely from a retail setting, showing product information and pricing.\n\nStyle Preference: The style is minimalist and functional, with a focus on clear information delivery.\n\nCore Text Content: The prominent text is \"Finish Quantum All In One Lemon PK 100 $40 ea,\" conveying product details and price.\n\nMain Message (Intention): This image wants to tell us that the product \"Finish Quantum All In One Lemon PK 100\" is available for purchase at $40 each.\n\nVisual Elements: The background is a simple digital screen with no additional elements. There are no people or other objects present."
  },
  {
    "img_id": "t3_1dq4cgt",
    "text": "What a cunt…",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: \"Imagine your sister being a rude enough bitch to wear white on your wedding day.\"\n\nMain Message (Intention): This image wants to tell us that it humorously criticizes social etiquette breaches at weddings.\n\nVisual Elements: The background features a wedding reception setting with tables and decorations. There are people present, dressed in formal wedding attire, with a focus on a bride and a child holding flowers."
  },
  {
    "img_id": "t3_1bwo592",
    "text": "Is this still acceptable?!",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: \"people on the 92nd floor\" and \"people below the 92nd floor.\"\n\nMain Message (Intention): This image wants to tell us that people in different situations can have vastly different experiences or perspectives, often humorously highlighting disparity.\n\nVisual Elements: The background features a snowy rooftop with a snow-covered chair in the foreground, and a cityscape with a fiery sky in the distance. There are no people or objects other than the chair."
  },
  {
    "img_id": "t3_1bua28i",
    "text": "What a fantastic little ass pussy",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"Man roleplaying with animal costumes must be like: oh fuck you are gunna make me neigh.\"\n\nMain Message (Intention): This image wants to humorously critique or poke fun at the concept of roleplaying with animal costumes.\n\nVisual Elements: The background features a close-up of a horse's face. There are no people, but the horse's expression is edited to appear humorous. There are no additional objects."
  },
  {
    "img_id": "t3_1ba7upb",
    "text": "That shit slaps",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\nStyle Preference: Satirical.\nCore Text Content: \"The back of hitlers skull\" and \"9mm bullet.\"\nMain Message (Intention): This image wants to tell us that it humorously criticizes or references a historical event with a satirical twist.\nVisual Elements: The background features an award show stage. Yes, there are people; one is in a suit, appearing to slap the other. The expressions suggest surprise and action. No additional objects are prominently featured."
  },
  {
    "img_id": "t3_1b9u16l",
    "text": "What exactly is this picture from?",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\nStyle Preference: Funny and satirical.\nCore Text Content: \"21st Century Humor But It's A Rave Song - Unofficial Music Video.\"\nMain Message (Intention): This image wants to tell us that it humorously critiques modern humor trends through a playful and unofficial music video theme.\nVisual Elements: Cartoon-style characters in a simple, colorful setting. Yes, there are people; they appear to be animated characters with neutral expressions. No significant objects are present."
  },
  {
    "img_id": "t3_1b98f3l",
    "text": "It was the 70s guys, things were spelt different",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.  \nStyle Preference: Funny, satirical.  \nCore Text Content: \"ool Aid & cyanide\"  \nMain Message (Intention): This image wants to tell us that a simple change in perspective or context can lead to a humorous or dark twist.  \nVisual Elements: Indoor setting with a plain wall and door in the background. Yes, there is a person, but their expression is not visible. No significant objects are present."
  },
  {
    "img_id": "t3_1b6d38v",
    "text": "This look familiar",
    "label": "humor",
    "description": "Image Type and Style: The image is a promotional poster for an album cover, specifically for Def Leppard's \"Pyromania.\"\n\nStyle Preference: It leans towards a vintage and dramatic style, typical of 1980s rock album art.\n\nCore Text Content: The most prominent text is \"Def Leppard Pyromania,\" conveying the album's title and the band's name.\n\nMain Message (Intention): This image wants to tell us that the album is explosive and intense, capturing the essence of rock music.\n\nVisual Elements: The background features a skyscraper with an explosion, surrounded by smoke and flames. There are no people visible. The focus is on the dramatic depiction of the explosion."
  },
  {
    "img_id": "t3_1b57cle",
    "text": "How to get respect",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"Since I began throwing out my trash like this, my neighbors started treating me with respect.\"\n\nMain Message (Intention): This image wants to tell us that humorously presenting trash as a human figure can change perceptions and interactions.\n\nVisual Elements: The background is plain, focusing on two images of trash bags. There are no people, but the trash is arranged to resemble a human figure. Objects include plastic bottles and bags."
  },
  {
    "img_id": "t3_1b3zeu9",
    "text": "Checkmate self esteem",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical and humorous.\n\nCore Text Content: \"You need to stop fucking eating.\"\n\nMain Message (Intention): This image wants to tell us that bulimia disrupts the enjoyment of eating, using humor to highlight the struggle.\n\nVisual Elements: The background features a formal setting with flags. There is a person pointing, conveying a serious expression. No objects are prominently featured."
  },
  {
    "img_id": "t3_1b34vu2",
    "text": "Disney presents DOG",
    "label": "humor",
    "description": "Image Type and Style: The image is a promotional poster for a Disney-Pixar production. It has a warm and family-oriented style.\n\nStyle Preference: The style leans towards warm and inviting, with a touch of nostalgia.\n\nCore Text Content: The most prominent text is \"Disney-Pixar DOG,\" suggesting a family-friendly theme.\n\nMain Message (Intention): This image wants to tell us that the film is about family and togetherness, likely with a focus on a dog.\n\nVisual Elements: The background features a traditional dining room with Chinese elements like lanterns and calligraphy. There are people sitting around a table, enjoying a meal, with expressions of contentment. There are objects like plates, chopsticks, and cups on the table."
  },
  {
    "img_id": "t3_1b0kkp6",
    "text": "I just need to feel something gents",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"Me high as fuck on fetty and vet tranquilizers listening to the Callahan Walker Spotify playlist.\"\n\nMain Message (Intention): This image wants to tell us that the experience of listening to the playlist is so intense it feels like being under the influence of strong substances.\n\nVisual Elements: The background is black. There is a cartoon frog character (Pepe the Frog) wearing headphones, with a relaxed and content expression. No other objects are present."
  },
  {
    "img_id": "t3_1b085oq",
    "text": "Only In America I guess",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical and funny.\n\nCore Text Content: \"Americans going to school: Some of you may die.\"\n\nMain Message (Intention): This image humorously criticizes the perceived dangers or challenges faced by students in American schools.\n\nVisual Elements: The background features a medieval setting with stone walls. There are two armored knights standing beside a central figure in a red outfit, gesturing dramatically. No objects are prominently featured."
  },
  {
    "img_id": "t3_1b0805b",
    "text": "Something off",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical.\n\nCore Text Content: No prominent text content.\n\nMain Message (Intention): This image wants to humorously criticize the design of the Xbox Series X by comparing it to the Twin Towers.\n\nVisual Elements: The background is plain with a shadow resembling an airplane. There are no people. The image features two Xbox Series X consoles standing upright with controllers placed in front of them."
  },
  {
    "img_id": "t3_1ax4aa3",
    "text": "LOL",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical and funny.\n\nCore Text Content: \"The jewish kid when the german kid buys all 4 railroads in the monopoly game.\"\n\nMain Message (Intention): This image wants to humorously criticize historical tensions through a playful Monopoly game scenario.\n\nVisual Elements: The background is a blurred image of a person, possibly from a wrestling event, with logos like WWF and UPN visible. There are no objects or clear expressions due to the blur."
  },
  {
    "img_id": "t3_1ah13um",
    "text": "If her age is in the clock she is ready for a cock",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Funny and satirical.\n\nCore Text Content: \"Went on a blind date with a German girl. Sex was so good she yelled nine a bunch. It's not a 10 but I'll take it.\"\n\nMain Message (Intention): This image wants to humorously play on the misunderstanding of the German word \"nein\" (no) as the number \"nine.\"\n\nVisual Elements: The background features a close-up of a surprised-looking squirrel. There are no other people or objects present."
  },
  {
    "img_id": "t3_18p1g28",
    "text": "Leone the cat dead'story",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image.\nStyle Preference: Funny and satirical.\nCore Text Content: \"Oh, that's an unskinned Alive cat\" conveys a humorous and absurd point of view.\nMain Message (Intention): This image wants to tell us that humor can be found in absurd and unexpected situations.\nVisual Elements: The background is a cartoon bathroom setting. There is a cartoon fish character from \"SpongeBob SquarePants\" looking into a toilet with a confused expression. No other objects are prominently featured."
  },
  {
    "img_id": "t3_18m90ze",
    "text": "Never in million years look up the “Small Tight Spaces” comic. Worst mistake ever. I’ll probably die.",
    "label": "humor",
    "description": "Image Type and Style: The image is an educational sign with a satirical style.\n\nStyle Preference: It leans towards satirical and vintage, with a whimsical yet critical tone.\n\nCore Text Content: The most prominent text is \"The Need Co,\" which critiques industrial greed and environmental neglect.\n\nMain Message (Intention): This image wants to tell us that unchecked industrialization harms the environment and society.\n\nVisual Elements: The background features a factory with smoke stacks and pollution. There are no people, but a character resembling the Lorax stands in the foreground, looking concerned. Objects include industrial machinery and a single Truffula tree."
  },
  {
    "img_id": "t3_18g9hkr",
    "text": "Am I gonna die from cancer?",
    "label": "humor",
    "description": "Image Type and Style: The image appears to be a candid photograph, possibly intended for personal or casual use.\n\nStyle Preference: The style is minimalist and informal, focusing on a natural, everyday setting.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that it captures a moment of casual, everyday life.\n\nVisual Elements: The background is plain and neutral, possibly a wall. There is a person present, wearing glasses and a dark hoodie, with a relaxed posture. There are no additional objects visible."
  },
  {
    "img_id": "t3_17yu1m6",
    "text": "Eat the rich!",
    "label": "humor",
    "description": "Image Type and Style: Meme-style humorous image with a satirical tone.\n\nStyle Preference: Satirical and darkly humorous.\n\nCore Text Content: \"Eat the rich\" - a phrase suggesting critique of wealth inequality.\n\nMain Message (Intention): This image wants to tell us that wealth disparity is a significant issue, humorously suggesting extreme measures.\n\nVisual Elements: The background is dark and possibly a dining setting. There is a person in formal attire, appearing to eat, with a serious expression. Objects include a plate of food and a wine glass."
  },
  {
    "img_id": "t3_8gcbm7d",
    "text": "Off topic but I received this in the mail I don’t have a baby…   ",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a promotional poster featuring product packaging and coupons.\n\nStyle Preference: The style is minimalist and practical, focusing on product information.\n\nCore Text Content: The most prominent text includes \"Enfamil NeuroPro\" and \"SAVE $5.00,\" suggesting a promotional offer.\n\nMain Message (Intention): This image wants to tell us that there is a discount available on Enfamil NeuroPro products, encouraging purchase.\n\nVisual Elements: The background includes a blue box with heart and star patterns. There are no people present. Objects include two cans of Enfamil formula, a shipping label, and a coupon."
  },
  {
    "img_id": "t3_fnizl8o",
    "text": "Babygate",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a minimalist photograph, possibly intended for social media or personal sharing.\n\nStyle Preference: It leans towards a minimalist and neutral style.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that everyday spaces can have a simple, understated beauty.\n\nVisual Elements: The image features a carpeted staircase with a wooden handrail, leading downwards. The background includes a plain wall and a glimpse of a carpeted room. There are no people or objects present."
  },
  {
    "img_id": "t3_9etaqk7",
    "text": "Pls help me find my baby’s toy",
    "label": "non-humorous",
    "description": "Image Type and Style:\nThis is a personal photograph.\n\nStyle Preference:\nIt leans towards warm and cozy.\n\nCore Text Content:\nThere is no text content in the image.\n\nMain Message (Intention):\nThis image wants to tell us that the child is enjoying a comforting moment with their stuffed toy.\n\nVisual Elements:\nThe background is a soft, textured blanket. There is a child holding a stuffed elephant toy, smiling and appearing happy. No other objects are visible."
  },
  {
    "img_id": "t3_0wf5cgr",
    "text": "Please for the love of god how do I put this fabric back on this swing????",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a casual photograph, possibly taken for personal or social media sharing.\n\nStyle Preference: The style is minimalist and informal, focusing on a single object without additional embellishments.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that it is showcasing a specific object, possibly for identification or sharing a moment.\n\nVisual Elements: The background features a wooden floor and part of a room. There are no people present. The main object is a gray fabric-covered item on a metal stand, possibly a piece of furniture or equipment."
  },
  {
    "img_id": "t3_6w093z1",
    "text": "Any luck with honey bear straw cup",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a casual photograph, likely intended for social media sharing or personal documentation.\n\nStyle Preference: The style is minimalist and informal, focusing on a single object without additional embellishments.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that sometimes everyday objects can have unexpected or humorous outcomes.\n\nVisual Elements: The background includes a blurred couch or seat, suggesting a home or casual setting. There are no people visible. The main object is a cup with a straw, held by a hand, with water droplets on it, indicating recent use or spillage."
  },
  {
    "img_id": "t3_a0d0h1e",
    "text": "Similac 360 Total Care",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a humorous meme-style image.\n\nStyle Preference: It leans towards a funny and satirical style.\n\nCore Text Content: The image does not contain any text.\n\nMain Message (Intention): This image wants to humorously highlight the unexpected presence of something unusual or amusing at the bottom of a milk bottle.\n\nVisual Elements: The background is neutral, possibly a kitchen or dining area. There are no people in the image. The main object is a milk bottle held upside down, showing some black specks at the bottom."
  },
  {
    "img_id": "t3_qndk5og",
    "text": "How to use a side sleeper with a bed frame like this?",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a promotional poster for a bed set, showcasing a product listing from an online store.\n\nStyle Preference: The style is minimalist, focusing on the product with a clean and straightforward presentation.\n\nCore Text Content: The prominent text includes the product name \"Makoa Low Platform Bed Set, Queen\" and the price \"$749.99.\"\n\nMain Message (Intention): This image wants to tell us that the bed set is available for purchase at a discounted price.\n\nVisual Elements: The background is plain white, emphasizing the bed set. There are no people or additional objects present."
  },
  {
    "img_id": "t3_i5letib",
    "text": "How do I remove this harness from the Britax Safe n Sound car seat!!!!!!!!",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is an educational sign, focusing on demonstrating a specific object or mechanism.\n\nStyle Preference: The style is minimalist, with a focus on clarity and functionality.\n\nCore Text Content: There is no prominent text or quote in the image.\n\nMain Message (Intention): This image wants to tell us how to properly use or adjust a safety harness or strap.\n\nVisual Elements: The background is a car interior. There are no people visible, but a hand is holding a strap, demonstrating its use. The object is a safety harness or strap, likely related to a car seat or safety equipment."
  },
  {
    "img_id": "t3_m189ifc",
    "text": "Maxi Cosi Pria Car seat Help",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a promotional poster showcasing a product, specifically a seatbelt buckle cover.\n\nStyle Preference: The style is minimalist, focusing on the product without any additional elements or distractions.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that the product is available for purchase, highlighting its design and functionality.\n\nVisual Elements: The background is a wooden floor, providing a neutral setting. There are no people or other objects present in the image."
  },
  {
    "img_id": "t3_ejy6h1o",
    "text": "Toddler Sling",
    "label": "non-humorous",
    "description": "Image Type and Style: Promotional poster.\nStyle Preference: Minimalist.\nCore Text Content: \"25% off.\"\nMain Message (Intention): This image wants to tell us that there is a discount offer on a product.\nVisual Elements: The background is a blurred outdoor setting with greenery. There are two people, an adult and a child, with the adult holding the child using a baby carrier. The adult appears relaxed and attentive. The baby carrier is a prominent object in the image."
  },
  {
    "img_id": "t3_k0en69e",
    "text": "Unknown car , Can Anyone Tell Me What It Is??",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a candid photograph, likely taken from inside a car, capturing a classic car in a parking lot.\n\nStyle Preference: The style leans towards a vintage and minimalist aesthetic, focusing on the classic car.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that classic cars can evoke a sense of nostalgia and appreciation for vintage design.\n\nVisual Elements: The background includes a parking lot with trees and other vehicles. There are no people visible in the image. The main object is a red classic convertible car with a black soft top."
  },
  {
    "img_id": "t3_r2ke9yq",
    "text": "New car!!! Any mod suggestions?",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a photograph, likely intended for personal or automotive interest rather than a promotional or inspirational purpose.\n\nStyle Preference: The style leans towards a vintage and minimalist aesthetic, focusing on the car with natural surroundings.\n\nCore Text Content: There is no prominent text or quote in the image.\n\nMain Message (Intention): This image wants to tell us that the car is the focal point, possibly showcasing its design or personal significance.\n\nVisual Elements: The background features a forested area with trees and a gravel path. There are no people present. The main object is a red car, which is the central focus of the image."
  },
  {
    "img_id": "t3_g2dsm0t",
    "text": "What is this mysterious cut on the dash of my family’s car?",
    "label": "non-humorous",
    "description": "Image Type and Style: \nThis is a meme-style humorous image.\n\nStyle Preference: \nThe style leans towards satirical and minimalist.\n\nCore Text Content: \nThere is no prominent text or quote in the image.\n\nMain Message (Intention): \nThis image wants to tell us that even minor imperfections can be highlighted humorously.\n\nVisual Elements: \nThe background is the interior of a car, specifically the dashboard. There are no people present. The image features a crack on the dashboard, humorously highlighted with a white circle."
  },
  {
    "img_id": "t3_7c95gzy",
    "text": "rocker panel dent from jack.",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a close-up photograph, likely intended for documentation or inspection purposes.\n\nStyle Preference: The style is minimalist and utilitarian, focusing on the details of the car's undercarriage.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that there is damage or wear on the car's undercarriage that may need attention or repair.\n\nVisual Elements: The background elements include the undercarriage of a car with visible scratches and bolts. There are no people or objects other than the car components."
  },
  {
    "img_id": "t3_c21xyni",
    "text": "Is this a rare car? Ive been stopped at my bases gate 3 times because they wanted to ask about my car.",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a casual photograph, likely taken for personal or social media sharing.\n\nStyle Preference: It leans towards a minimalist and warm style, capturing a simple everyday scene.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that it captures a moment of everyday life, showcasing a parked car in a sunny setting.\n\nVisual Elements: The background includes a parking lot with a brick building and mountain scenery. There are no people present. The main object is a parked car, with sunlight reflecting off its surface."
  },
  {
    "img_id": "t3_1oc3pj8",
    "text": "Worth to buy stock Nissan 240sx?",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a simple photograph, not a quote or promotional image.\n\nStyle Preference: The style is minimalist and straightforward.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that it is a straightforward depiction of a parked car, possibly highlighting the car itself.\n\nVisual Elements: The background includes a parking lot with a few other vehicles and some trees. There are no people present. The main object is a red car parked in a parking space."
  },
  {
    "img_id": "t3_jrkfaaq",
    "text": "is this mud rust or oil in it?",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a practical, educational sign-style photo.\n\nStyle Preference: It leans towards a minimalist and straightforward style.\n\nCore Text Content: There is no prominent text or quote in the image.\n\nMain Message (Intention): This image wants to tell us that checking and maintaining car engine components is important for vehicle health.\n\nVisual Elements: The background elements include parts of a car engine, specifically the radiator and surrounding components. There are no people present. The objects visible are car engine parts, including a radiator cap with some rust or residue around it."
  },
  {
    "img_id": "t3_qk7vt4u",
    "text": "What's the purpose of this handle?",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a casual photograph taken from inside a car, capturing a view of the road ahead.\n\nStyle Preference: The style is minimalist and informal, with a focus on everyday life.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that it’s about enjoying a simple road trip or journey.\n\nVisual Elements: The background shows a clear blue sky and a road lined with green trees. There are no people visible, and the car dashboard is the main object in the foreground."
  },
  {
    "img_id": "t3_2ckwzke",
    "text": "Is this car famous overseas too? Just curious from a Japanese girl!",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a promotional poster featuring a car, likely showcasing its design and appeal.\n\nStyle Preference: The style leans towards a modern and sleek aesthetic, emphasizing the car's contemporary design.\n\nCore Text Content: There is no prominent text or quote visible in the image.\n\nMain Message (Intention): This image wants to tell us that the car is stylish and desirable, appealing to those interested in modern automotive design.\n\nVisual Elements: The background includes an urban setting with glass buildings and other vehicles. There are no people visible, and the focus is on the car itself."
  },
  {
    "img_id": "t3_q2rdpje",
    "text": "How do I get rid of this?!",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a humorous, meme-style photograph.\n\nStyle Preference: It leans towards a funny and satirical style.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that sometimes unexpected shapes or patterns can create humorous or amusing interpretations.\n\nVisual Elements: The background is a close-up of a car's metallic surface with streaks resembling a ghostly face. There are no people or objects present."
  },
  {
    "img_id": "t3_l6olgg2",
    "text": "Cozy Eldritch Night, Pumpkynvine, Digital, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a digital artwork, possibly a character illustration, with a warm and vintage style.\n\nStyle Preference: It leans towards a dreamy and vintage aesthetic.\n\nCore Text Content: There is no prominent text or quote in the image.\n\nMain Message (Intention): This image wants to tell us that it is a character-focused artwork, possibly showcasing a fantasy or whimsical theme.\n\nVisual Elements: The background includes a cozy room setting with a window and a lamp. There is a woman with red hair sitting on a couch, looking relaxed and slightly playful. A small green creature, possibly a fantasy animal, is perched nearby."
  },
  {
    "img_id": "t3_owvw88n",
    "text": "Standing woman, touching grass, Fraser Gray (me), gouache, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is an artistic photograph with a surreal, dreamy style.\n\nStyle Preference: It leans towards a dreamy and colorful aesthetic with a psychedelic touch.\n\nCore Text Content: There is no text content visible in the image.\n\nMain Message (Intention): This image wants to tell us that it is an exploration of color and form, evoking a sense of wonder and imagination.\n\nVisual Elements: The background features a textured surface resembling a woven fabric. There is a person standing on a rock, with vibrant, multicolored hues overlaying their figure. There are no additional objects present."
  },
  {
    "img_id": "t3_uq2z1l3",
    "text": "The Hat Man, Chris Earl, Pen & Ink, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a vintage-style illustration with a dark, mysterious tone.\n\nStyle Preference: It leans towards a vintage and eerie style, evoking a sense of mystery and suspense.\n\nCore Text Content: There is no prominent text or quote in the image.\n\nMain Message (Intention): This image wants to tell us that it is exploring themes of mystery and the unknown, possibly hinting at a narrative of suspense or fear.\n\nVisual Elements: The background features a dimly lit room with a bed. There is a shadowy figure wearing a top hat standing near the bed. No objects are prominently visible."
  },
  {
    "img_id": "t3_j2zcg4z",
    "text": "Across the Pond, Jon Byrer, oil enamel, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a dreamy, artistic landscape painting.\n\nStyle Preference: It leans towards a dreamy and slightly abstract style.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that nature can be both serene and mystical, inviting viewers to appreciate its beauty.\n\nVisual Elements: The background features a night sky with swirling clouds and a bright moon. There is a lake reflecting the moonlight, surrounded by trees. A small cabin with lit windows is visible, suggesting warmth and solitude. There are no people or additional objects present."
  },
  {
    "img_id": "t3_ogzmlog",
    "text": "8-Ball, EmilyCopeland (me), Charcoal, 2017",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a minimalist, realistic drawing of a billiard ball.\n\nStyle Preference: It leans towards a minimalist and realistic style.\n\nCore Text Content: There is no prominent text or quote in the image.\n\nMain Message (Intention): This image wants to tell us that simplicity and focus can be visually striking.\n\nVisual Elements: The background is plain, emphasizing the detailed drawing of the black 8-ball. There are no people or additional objects present."
  },
  {
    "img_id": "t3_sx3oyg8",
    "text": "My Wife, Vinnie Akio, Charcoal, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a charcoal drawing, leaning towards a minimalist and vintage style.\n\nStyle Preference: The style is formal and artistic, with a focus on monochromatic tones.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that art can capture the essence and mood of a subject through minimalistic expression.\n\nVisual Elements: The background is a textured surface, possibly a canvas or paper. There are no objects present. There is a person depicted, sitting with a relaxed posture, showcasing tattoos on their arms."
  },
  {
    "img_id": "t3_2dpg7ke",
    "text": "Circadian Light, Mustapha Yasir, Oil, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a landscape painting with a dreamy and minimalist style.\n\nStyle Preference: It leans towards a dreamy and serene aesthetic.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that nature's beauty can evoke a sense of peace and tranquility.\n\nVisual Elements: The background features a field with a path leading towards a line of trees under a sky with pink and purple hues. There are no people or objects present."
  },
  {
    "img_id": "t3_xj1ctka",
    "text": "Raindrops Falling Atop a Stream, Josh Byer, mixed media, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a dreamy, watercolor painting.\n\nStyle Preference: It leans towards a dreamy and whimsical style.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that nature can be enchanting and serene.\n\nVisual Elements: The background features a forest with bare trees and a small house. There is a river flowing through the scene with swirling patterns. There are no people present. The objects include various plants and rocks along the riverbank."
  },
  {
    "img_id": "t3_jwrdxjh",
    "text": "Clear Boundaries, Hayden Clay, Digital 3D, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a surreal artistic photograph.\n\nStyle Preference: It leans towards a minimalist and dreamy style.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that perception can be altered, creating illusions in everyday environments.\n\nVisual Elements: The background features a clear blue sky and a house with a sloped roof. There is a mirrored fence reflecting the sky and surroundings, creating an illusion of transparency. There are no people or objects like books or phones present."
  },
  {
    "img_id": "t3_why4wpb",
    "text": "Colorful, Figgeart, watercolor, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a dreamy, minimalist watercolor painting.\n\nStyle Preference: It leans towards a dreamy and serene style.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that nature can evoke a sense of tranquility and peace.\n\nVisual Elements: The background features a forest with tall trees silhouetted against a colorful sunset sky. There are no people or objects present."
  },
  {
    "img_id": "t3_rkl5jrd",
    "text": "Last Ride, Civort, Digital Painting, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a digital artwork with a dreamy and surreal style.\n\nStyle Preference: It leans towards a dreamy and slightly whimsical aesthetic.\n\nCore Text Content: The text on the car reads \"Stay Weird,\" conveying a tone of encouragement to embrace individuality and uniqueness.\n\nMain Message (Intention): This image wants to tell us that embracing one's uniqueness and being different is valuable and should be celebrated.\n\nVisual Elements: The background features a serene water scene with lily pads. There are no people present. The main object is a car partially submerged in water, with its headlights illuminating the surroundings."
  },
  {
    "img_id": "t3_v6txnaf",
    "text": "Journey to Blue Waters, Mark Maggiori, Oil on canvas, 2024",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a digital painting, leaning towards a dreamy and vintage style.\n\nStyle Preference: It has a warm and atmospheric style, with rich colors and dramatic lighting.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that there is beauty and tranquility in the simplicity of nature and human connection.\n\nVisual Elements: The background features a dramatic sky with large, illuminated clouds. There are three people on horseback, riding across a grassy landscape. Their expressions are calm and contemplative, suggesting a peaceful journey."
  },
  {
    "img_id": "t3_imprn5q",
    "text": "Lilacs, ArtsyKate, oils, 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a painting, likely a still life, with a focus on artistic expression.\n\nStyle Preference: It leans towards a warm and vibrant style with a touch of realism.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us to appreciate the beauty and vibrancy of nature through art.\n\nVisual Elements: The background is a bright yellow, possibly representing a wall or abstract space. There are no people. The main object is a vase with colorful flowers and green leaves, casting a shadow on a surface."
  },
  {
    "img_id": "t3_vyawvdf",
    "text": "[OC] Elon Musk's claims on a Manned Mission to Mars",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is an educational sign, presented in a minimalist style.\n\nStyle Preference: It leans towards a formal and informative style.\n\nCore Text Content: The prominent text is \"How many years Elon Musk has claimed it will be until we have a manned mission to Mars.\"\n\nMain Message (Intention): This image wants to tell us that Elon Musk's predictions for a manned mission to Mars have consistently changed over the years.\n\nVisual Elements: The background is a simple black grid with a red line graph. There are no people or additional objects present."
  },
  {
    "img_id": "t3_nzk5o9s",
    "text": "[OC] Fewer American boys are supporting gender equality",
    "label": "non-humorous",
    "description": "Image Type and Style: \nThis is an educational sign, specifically a data chart.\n\nStyle Preference: \nThe style is minimalist and formal.\n\nCore Text Content: \nThe prominent text is \"Fewer American boys believe in gender equality,\" conveying a critique of changing attitudes.\n\nMain Message (Intention): \nThis image wants to tell us that there is a decline in the belief in gender equality among American boys.\n\nVisual Elements: \nThe background is plain, focusing on the chart. There are no people or objects depicted."
  },
  {
    "img_id": "t3_m96z5wn",
    "text": "[OC] American confindece in national institutions, by partisanship, 1974-2024. A total collapse in Democrats' confidence in the Supreme Court since 2022.",
    "label": "non-humorous",
    "description": "Image Type and Style: Educational sign; minimalist style.\n\nCore Text Content: The most prominent text is \"Mean confidence in 13 national institutions, by partisanship, 1974-2024,\" conveying a reflective and analytical tone.\n\nMain Message (Intention): This image wants to tell us that public confidence in various national institutions varies over time and is influenced by political affiliation.\n\nVisual Elements: The background consists of a grid of line graphs representing different institutions. There are no people or objects depicted in the image."
  },
  {
    "img_id": "t3_myqqpea",
    "text": "OnlyFans brings more revenue per employee than NVIDIA, Apple, Tesla etc. combined [OC]",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is an educational sign, specifically a data chart comparing revenue efficiency across companies.\n\nStyle Preference: The style is minimalist and formal, focusing on data presentation.\n\nCore Text Content: The prominent sentence is \"OnlyFans is possibly the most 'revenue efficient' company in the world (and no one comes even close),\" conveying a point of view with a tone of reflection and critique.\n\nMain Message (Intention): This image wants to tell us that OnlyFans generates significantly more revenue per employee compared to other major companies.\n\nVisual Elements: The background is plain, emphasizing the data chart. There are no people or objects depicted."
  },
  {
    "img_id": "t3_0wqqxy1",
    "text": "[OC] FEMA Tornado Disasters Since 1980",
    "label": "non-humorous",
    "description": "Image Type and Style: Educational sign; informative and data-driven.\n\nStyle Preference: Minimalist and formal.\n\nCore Text Content: \"FEMA Tornado Disasters Since 1980\" conveys a factual and informative tone.\n\nMain Message (Intention): This image wants to tell us that certain counties in the U.S. have experienced multiple tornado disasters since 1980, highlighting areas of frequent tornado activity.\n\nVisual Elements: The background is a map of the United States with color-coded regions indicating tornado disaster frequency. There are no people. The map includes a legend and a list of the top 11 counties affected."
  },
  {
    "img_id": "t3_rzcx6lt",
    "text": "[OC] Brazil has the 3rd-most Formula 1 wins ever",
    "label": "non-humorous",
    "description": "Image Type and Style: Educational sign; infographic style.\n\nStyle Preference: Minimalist and formal.\n\nCore Text Content: \"Brazil has the 3rd-most F1 wins ever.\"\n\nMain Message (Intention): This image wants to tell us that Brazil is a significant contributor to Formula 1 race wins, ranking third globally.\n\nVisual Elements: The background is a graph showing F1 race wins by country, with flags and driver icons. There are no people depicted, but driver icons represent individuals. The graph includes country names and win percentages, with a focus on Latin American drivers."
  },
  {
    "img_id": "t3_3fhyb0n",
    "text": "[OC] My COVID Progression of Symptoms",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is an educational sign, specifically a graph depicting COVID symptoms over time.\n\nStyle Preference: The style is minimalist, focusing on clear data presentation without decorative elements.\n\nCore Text Content: The most prominent text is \"COVID Symptoms,\" which conveys an informative point of view.\n\nMain Message (Intention): This image wants to tell us that COVID symptoms vary in intensity and duration over time.\n\nVisual Elements: The background is a simple black grid with colored lines representing different symptoms. There are no people or objects depicted."
  },
  {
    "img_id": "t3_cakjc6m",
    "text": "WE HAVE A SPOT ON r/Place! COME AND HELP! (Spot tags are in a banner in the sub when you go into the sub from mobile",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a pixel art graphic, resembling a retro video game style.\n\nStyle Preference: It leans towards a minimalist and vintage style.\n\nCore Text Content: The prominent text is \"LBF,\" which does not convey a clear message or emotion.\n\nMain Message (Intention): This image wants to tell us that pixel art can be simple yet visually engaging.\n\nVisual Elements: The background is a grid pattern with a blue color. There is a pixelated yellow duck in the center. There are no people or additional objects present."
  },
  {
    "img_id": "t3_uvf9omy",
    "text": "What the SEO Expert do",
    "label": "non-humorous",
    "description": "Image Type and Style: Meme-style humorous image.\n\nStyle Preference: Satirical and funny.\n\nCore Text Content: The most prominent phrase is \"SEO expert,\" followed by humorous captions like \"What I think I do,\" \"What my mom thinks I do,\" \"What my friends think I do,\" and \"What I actually do.\"\n\nMain Message (Intention): This image wants to tell us that perceptions of an SEO expert's job vary widely and humorously contrast with reality.\n\nVisual Elements: The background includes various settings like a tech environment, a formal office, a home office, and a lawn. There are people in different scenarios, such as working at a computer, dressed formally, and kneeling by a Google sign."
  },
  {
    "img_id": "t3_sxa9c8i",
    "text": "The 80:20 rule is referred to as Pareto principle. But, how does it apply to digitalmarketing?",
    "label": "non-humorous",
    "description": "Image Type and Style: This is a promotional poster focused on email marketing.\n\nStyle Preference: The style is minimalist and formal, with a clean design.\n\nCore Text Content: The prominent text reads, \"Do you know that nearly 80% of sales come from 20% of your customers?\" It conveys a point of view about customer sales dynamics.\n\nMain Message (Intention): This image wants to tell us that understanding customer sales distribution is crucial for effective marketing strategies.\n\nVisual Elements: The background features a simple illustration of an envelope, paper plane, and notification bell. There are no people present."
  },
  {
    "img_id": "t3_vdx3xu7",
    "text": "Hehe I love her, what should we name her?",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a photograph, likely intended for social media sharing or personal documentation.\n\nStyle Preference: The style is minimalist, focusing on the subject with a clear and simple composition.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that the gecko is in a comfortable and naturalistic habitat.\n\nVisual Elements: The background includes a terrarium setup with rocks and artificial plants. There are no people present. The main subject is a gecko, which is resting on a rock. There are no additional objects like books or phones."
  },
  {
    "img_id": "t3_8rv91j7",
    "text": "Legion Go S with SteamOS Arrived a Day Before Release",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a promotional poster showcasing a tech product, specifically a handheld gaming device.\n\nStyle Preference: The style is minimalist, focusing on the device itself.\n\nCore Text Content: The most prominent text is \"Welcome,\" suggesting a user-friendly and inviting experience.\n\nMain Message (Intention): This image wants to tell us that the device is ready for use and offers a variety of language options, emphasizing accessibility and ease of use.\n\nVisual Elements: The background is a patterned fabric surface. There are no people present. The main object is the handheld gaming device displaying a language selection screen."
  },
  {
    "img_id": "t3_q94xg12",
    "text": "ZOTAC showcased their next-gen handheld running Linux at Computex 2025",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a promotional poster showcasing a handheld gaming device.\n\nStyle Preference: The style is minimalist and modern, focusing on the device's design.\n\nCore Text Content: There is no prominent sentence or phrase, but the device's screen displays a serene digital landscape.\n\nMain Message (Intention): This image wants to tell us that the device offers a portable and immersive gaming experience.\n\nVisual Elements: The background is a simple wooden surface. There are no people, but a hand is holding the device. The screen shows a digital landscape with a lighthouse and mountains."
  },
  {
    "img_id": "t3_hwuy8qr",
    "text": "Found cockatiel",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a photograph of a bird, likely intended for social media or personal sharing.\n\nStyle Preference: The style is minimalist, focusing on the bird with a neutral background.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that birds can be beautiful and serene pets.\n\nVisual Elements: The background consists of a birdcage with bars. There are no people present. The main object is a cockatiel perched on a branch inside the cage, looking directly at the camera with a calm expression."
  },
  {
    "img_id": "t3_ro1g8z8",
    "text": "Meet Keiko the sweetest old lady you'd ever meet!(14years)",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a candid photograph, likely intended for social media sharing.\n\nStyle Preference: It leans towards a warm and humorous style.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that dogs can be both adorable and amusing, capturing a lighthearted moment.\n\nVisual Elements: The background features a park setting with grass and trees. There are no people present. The main subject is a dog wearing a harness, looking directly at the camera with a playful expression and drool visible. There is a metal bench partially visible on the right side."
  },
  {
    "img_id": "t3_fuywyjw",
    "text": "Lexi is a 10? year old rescue lab mix and Lincoln is a 3 year old Goldendoodle. They always like to be touching.",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a photograph, likely intended for social media sharing, capturing a candid moment.\n\nStyle Preference: The style leans towards warm and cozy, with a focus on companionship and comfort.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that companionship and friendship bring warmth and comfort.\n\nVisual Elements: The background is a simple indoor setting with wooden flooring. There are two dogs lying close together, one black and one white, both appearing relaxed and content. There are no other objects present."
  },
  {
    "img_id": "t3_wywsyci",
    "text": "The turtles of Central Park",
    "label": "non-humorous",
    "description": "Image Type and Style: The image is a nature photograph.\n\nStyle Preference: It leans towards a minimalist and natural style.\n\nCore Text Content: There is no text content in the image.\n\nMain Message (Intention): This image wants to tell us that nature can be serene and peaceful.\n\nVisual Elements: The background features a calm river surrounded by lush green trees. There are no people present. The main focus is a group of turtles basking on a large rock in the river. There is also a part of a boat visible in the foreground."
  }
]