[
  {
    "video_id": "1",
    "text": "Man attempts to bash people online, ends up describing HIMSELF 1 to 1.",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/1k9r074/man_attempts_to_bash_people_online_ends_up/",
    "description": "1. The video is a short clip, likely an interview segment, with a conversational and somewhat humorous style.\n2. The emotional tone is light-hearted and engaging, with a hint of frustration when discussing the challenges of the game.\n3. The most prominent sentence is: 'It's a very, very difficult game to play, and it's a very, very difficult game to commentate on.'\n4. This video wants to tell us that the game being discussed is complex and challenging, both for players and commentators.\n5. The main visual elements include a man in a red t-shirt and headphones, sitting in a room with a poster and a plush toy in the background. He is speaking into a microphone, suggesting an interview or commentary setting."
  },
  {
    "video_id": "2",
    "text": "MURICA",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/1jwxuk1/murica/",
    "description": "1. Video Type and Style: The video is a short clip, likely part of a larger video or a stand-alone piece, with a documentary-like style. It presents information in a straightforward manner without embellishments.\n\n2. Tone and Emotion: The tone is neutral and informative. The video does not aim to evoke strong emotions but rather to convey information about the product.\n\n3. Key Dialogue or Text: The most prominent text in the video is the label on the product that reads, 'MADE IN THE USA.'\n\n4. Main Message (Summary Sentence): This video wants to tell us that the product is made in the USA, emphasizing its American origin.\n\n5. Visual Composition: The main visual element is a hand holding a white shield-shaped sign with the text 'MADE IN THE USA' and stars. The background is blurred, focusing attention on the sign."
  },
  {
    "video_id": "3",
    "text": "I got a good chuckle out of this one",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/1jk6c80/i_got_a_good_chuckle_out_of_this_one/",
    "description": "1. Video Type and Style: The video is a short clip, likely an interview segment or a teaser for a documentary. The style is serious and investigative, suggesting a focus on revealing hidden truths or exposing wrongdoing.\n\n2. Tone and Emotion: The emotional tone is tense and serious, with a sense of urgency and concern. The speaker's facial expressions and the dark background contribute to this mood.\n\n3. Key Dialogue or Text: The most prominent text in the video is the title card that reads, 'THE MONSTERS' and 'EPSTEIN'S LIFE AMONG THE GLOBAL ELITE.'\n\n4. Main Message (Summary Sentence): This video wants to tell us that Epstein's life and activities were intertwined with those of the global elite, suggesting a narrative of power, influence, and possibly scandal.\n\n5. Visual Composition: The main visual elements include an older man with gray hair and glasses, wearing a light blue shirt, speaking in what appears to be an indoor setting with a blurred background. The video also features a title card with the text mentioned above."
  },
  {
    "video_id": "4",
    "text": "Don’t get tiktok!!1!",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/1iowe4s/dont_get_tiktok1/",
    "description": "1. Video Type and Style: The video is a short clip with a humorous and meme-like style.\n2. Tone and Emotion: The emotional tone is light-hearted and comedic.\n3. Key Dialogue or Text: 'someone: *googling how to install TikTok* 😂💔 god: *so you know some sins are unforgivable* boys: *Wait. That's illegal.* 😂'\n4. Main Message (Summary Sentence): This video wants to tell us that installing TikTok is humorously portrayed as a serious sin.\n5. Visual Composition: The video features a group of people in a room, with one person in a suit and others in casual attire, engaging in a humorous dance or movement."
  },
  {
    "video_id": "5",
    "text": "Thanks to you guys I got banned for defendingaiart",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/1igjd2o/thanks_to_you_guys_i_got_banned_for_defendingaiart/",
    "description": "1. The video is a compilation of screenshots from a social media platform, presented in a fast-paced, meme-like style.\n2. The tone is humorous and ironic, poking fun at the absurdity of AI-generated content and the reactions it elicits.\n3. \"AI bros complaining about AI stealing their AI 'art'.\"\n4. This video wants to tell us that AI-generated content can be both impressive and ridiculous, often sparking humorous reactions.\n5. The video features a series of screenshots with text overlays, images, and memes, primarily in black, white, and yellow colors, with a focus on AI-generated art and humorous commentary."
  },
  {
    "video_id": "6",
    "text": "Does this count? I'm new here",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/1hkq0ut/does_this_count_im_new_here/",
    "description": "1. The video is a short clip with a humorous and informative style, focusing on survival tips.\n2. The tone is light-hearted and engaging, with a touch of excitement.\n3. 'Never split a match or you will DIE in #survival #outdoors' is the prominent text.\n4. This video wants to tell us that using stormproof matches is crucial for survival in outdoor situations.\n5. The video features close-ups of hands holding matches and a matchbox, with text overlays and a person demonstrating the use of an 'indestructible' match."
  },
  {
    "video_id": "7",
    "text": "Anyone want to join?",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/1g1uxe7/anyone_want_to_join/",
    "description": "1. Video Type and Style: This video is a short clip with a humorous style, likely part of a larger interview or talk show segment.\n2. Tone and Emotion: The emotional tone is light-hearted and humorous, with a focus on playful banter.\n3. Key Dialogue or Text: The most prominent sentence is, 'I'm not a good dancer, but I can do this one move called the worm.' This highlights the comedic nature of the interaction.\n4. Main Message (Summary Sentence): This video wants to tell us that even if someone is not skilled at dancing, they can still participate and have fun with simple moves.\n5. Visual Composition: The main visual elements include two individuals with cardboard boxes over their heads, standing in an indoor setting with a railing and a window in the background. The scene is brightly lit, and the individuals are engaged in a playful conversation."
  },
  {
    "video_id": "8",
    "text": "CashMo VPN",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/18bf247/cashmo_vpn/",
    "description": "Video Type and Style: This video is a satirical advertisement with a darkly humorous and provocative style. Tone and Emotion: The emotional tone is edgy and controversial, aiming to shock and provoke thought. Key Dialogue or Text: 'Get paid to expose your secrets today with cashmere VPN.' and 'Stop protecting your privacy and start sharing it with the world.' Main Message: This video wants to tell us that the concept of a VPN service that encourages users to expose their secrets for money is absurd and highlights the dangers of compromising privacy. Visual Composition: The video features various scenes including a person in red lighting, a Santa Claus figure, a close-up of a beer bottle labeled 'Spider Valley,' an alien-headed person in a bikini, two people in leopard print and purple pants, a shirtless man with sunglasses, a graphic of a heart with a silhouette and a gun, and a 'SCAM ALERT' text."
  },
  {
    "video_id": "9",
    "text": "What ever happened to leaving things to the imagination?",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/186wabr/what_ever_happened_to_leaving_things_to_the/",
    "description": "1. The video is a short clip with a humorous and provocative style, resembling an advertisement or social media post.\n2. The emotional tone is playful and slightly suggestive, aiming to grab attention and provoke thought.\n3. \"whatever happened to leaving things to the imagination these days nothing is\"\n4. This video wants to tell us that the world has become too revealing and it's time to embrace subtlety.\n5. The video features women in various settings, including a beach, indoors, and in a meditative pose, wearing different types of bras and undergarments."
  },
  {
    "video_id": "10",
    "text": "It gets harder every year",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/1i4b9t7/it_gets_harder_every_year/",
    "description": "1. The video is a short, humorous clip featuring a man in a red shirt discussing veganism in a grocery store setting. The style is casual and engaging, resembling a social media post or a short video clip.\n2. The emotional tone is light-hearted and humorous, with the man using exaggerated gestures and expressions to emphasize his points.\n3. Key dialogue includes phrases like 'TO COVER JUST,' 'HOW HARD IT IS TO BE A VEGAN,' and 'IN THE YEAR 2025,' highlighting the increasing difficulty of maintaining a vegan diet.\n4. This video wants to tell us that being vegan in the future might become increasingly challenging due to the lack of availability of certain products.\n5. The main visual elements include the man in a red shirt, various grocery store aisles filled with fruits, vegetables, and other products, and text overlays emphasizing key points in the dialogue."
  },
  {
    "video_id": "11",
    "text": "How to Make Sure You Stay Poor | Authentic Introverts",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/1e389bv/how_to_make_sure_you_stay_poor_authentic/",
    "description": "1. Video Type and Style: The video is a short clip with a satirical and humorous style, using exaggerated scenarios and sarcastic narration to convey its message.\n2. Tone and Emotion: The emotional tone is light-hearted and humorous, using irony to address the topic of poverty.\n3. Key Dialogue or Text: 'Being poor is perhaps one of the most challenging experiences one can ever have.' This sets the initial tone and introduces the topic.\n4. Main Message (Summary Sentence): This video wants to tell us that poverty can be seen as a challenging yet potentially rewarding experience, and it mocks the idea of choosing to be poor.\n5. Visual Composition: The video features various people in different settings, including a person in a blue shirt speaking, a person in a white shirt and plaid scarf sitting on a green couch, and a person in a suit holding money. It also includes scenes of a roulette wheel, a person leaning against a wall, and a person burning money."
  },
  {
    "video_id": "12",
    "text": "Women love money?",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/18ffpzy/women_love_money/",
    "description": "1. Video Type and Style: The video is a compilation of short clips, likely from a larger video or series, with a focus on visual aesthetics and text overlays. The style is modern and visually driven, possibly for social media or online content.\n2. Tone and Emotion: The emotional tone varies across clips, ranging from playful and humorous to mysterious and intriguing. The overall mood is engaging and visually stimulating.\n3. Key Dialogue or Text: The most prominent text overlay is 'MISTRESS OH YEAH,' which sets a provocative and alluring tone.\n4. Main Message (Summary Sentence): This video wants to tell us that it explores themes of allure, mystery, and modern identity through visually striking and provocative imagery.\n5. Visual Composition: The video features close-up shots of women in various poses and outfits, often with text overlays. The backgrounds are mostly plain or abstract, emphasizing the subjects and text."
  },
  {
    "video_id": "13",
    "text": "Pixie dust, the real story",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/17wb35h/pixie_dust_the_real_story/",
    "description": "1. The video is a short, humorous clip featuring an animated fairy character, Tinkerbell, in a whimsical setting. The style is reminiscent of a fairy tale with a comedic twist.\n2. The emotional tone is light-hearted and humorous, with a touch of irony and disbelief.\n3. The most prominent sentence in the video is: \"THE TRUTH ABOUT PIXIE DUST.\"\n4. This video wants to tell us that the concept of pixie dust, often perceived as magical, is actually a mundane and even disgusting substance.\n5. The main visual elements include Tinkerbell, a fairy with translucent wings and a glowing aura, set against a dark background. She interacts with sparkling particles, and there are close-up shots of hands covered in these particles, emphasizing the contrast between the magical appearance and the mundane reality."
  },
  {
    "video_id": "14",
    "text": "Filter with fruit",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/17tbjhv/filter_with_fruit/",
    "description": "1. Video Type and Style: The video is a short clip with a humorous and satirical style, resembling an advertisement. It uses exaggerated scenarios and visuals to convey its message.\n2. Tone and Emotion: The video starts with a neutral and relaxing tone during the massage scenes, then shifts to a humorous and slightly provocative tone with the introduction of the 'Fruit Filter' concept.\n3. Key Dialogue or Text: \"new software will transform inappropriate pictures sent to you into delightful fruits you'll never see another di pick again unless you want to.\"\n4. Main Message (Summary Sentence): This video wants to tell us that the 'Fruit Filter' software will transform inappropriate images into fruit pictures, promoting a safer and more positive digital communication experience.\n5. Visual Composition: The video features a mix of serene massage scenes, a woman in a red suit checking her phone, a woman in a white sweater looking at her phone, and various fruit visuals, including a pineapple and bananas. The 'FRUIT FILTER' text is prominently displayed in bold, pink letters."
  },
  {
    "video_id": "15",
    "text": "DewDa ZombieDanse",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/17glg12/dewda_zombiedanse/",
    "description": "1. The video is a short clip with a dark, horror-like style.\n2. The emotional tone is eerie and unsettling.\n3. The prominent sentence is: \"Elegance sending shivers down the spines of all who dared to witness this in.\"\n4. This video wants to tell us that the undead can be graceful and unsettling at the same time.\n5. The video features zombies in various settings, including a forest, a house, and a car, performing dance-like movements."
  },
  {
    "video_id": "16",
    "text": "Beautiful damnation",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/17eigmr/beautiful_damnation/",
    "description": "The video is a humorous advertisement styled as a parody of a real estate promotion. It uses a satirical tone to present the concept of 'Hell Estate,' where damned souls can enjoy luxurious amenities. The emotional tone is a blend of dark humor and absurdity. The key dialogue includes phrases like 'speculation anyway you'll be damned to miss out on these great deals your soul' and 'can burn comfortably in one of our luxurious spacious condos with.' The main message is that the video wants to tell us that even in the Underworld, there are exclusive deals for damned souls to enjoy a 'heavenly time.' The visual composition features fiery imagery, luxurious interiors, and a pool area, all tinted with warm, infernal colors."
  },
  {
    "video_id": "17",
    "text": "What happens when your sneaky links don't want to be sneaky links anymore?",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/17bzd4v/what_happens_when_your_sneaky_links_dont_want_to/",
    "description": "1. The video is a short, artistic piece with a mysterious and unsettling style.\n2. The emotional tone is tense and anxious, with a strong sense of unease and dread.\n3. \"worth it wasn't and now that it is all over the Internet it can never be\"\n4. This video wants to tell us that the consequences of online actions can be profound and irreversible, leading to a sense of being trapped and exposed.\n5. The video features a person in a white room, with a focus on their upper body and face. The lighting is stark, and the person's movements are deliberate and slow, contributing to the overall mood of the video."
  },
  {
    "video_id": "18",
    "text": "Weird weird",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/175jhjd/weird_weird/",
    "description": "1. Video Type and Style: The video appears to be a short clip, possibly an interview segment or a reaction video, with a serious and somewhat unsettling tone.\n2. Tone and Emotion: The emotional tone is tense and unsettling, with a sense of unease and discomfort.\n3. Key Dialogue or Text: The most prominent text in the video is the repeated phrase 'weird weird weird ......"

  },
    {
    "img_id": "19",
    "text": "As soon as it’s turned on, it casts a hypnotic spell upon its prey, drawing them into its eerie embrace with self-obsession. It whispers sweet nothings, promising perfection and eternal youth.",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/172pv59/as_soon_as_its_turned_on_it_casts_a_hypnotic/",
    "description":"Video Type and Style: This video is a satirical and eerie short clip with a darkly humorous style. Tone and Emotion: The emotional tone is unsettling and cautionary, aiming to evoke a sense of unease and skepticism. Key Dialogue or Text: 'You dating app that matches You with eligible demon bachelors, all with verified accounts for that true demonic experience You'll be possessed before the week's over guaranteed.' and 'So ring light, it seems innocent but beware for this object is cursed.' Main Message: This video wants to tell us that seemingly innocent objects like ring lights can have a sinister side, symbolizing vanity and obsession. Visual Composition: The video features various scenes including a person holding a coffee cup, a white circular frame, a person with braided hair holding a ring light, a person in a striped shirt with headphones, a person in a pink crop top and plaid skirt, and a person sitting at a desk with a ring light and a smartphone."
  },
  {
    "video_id": "20",
    "text": "Meet Suki, she's a robot",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/170kkdx/meet_suki_shes_a_robot/",
    "description": "Video Type and Style: This video is a satirical advertisement with a darkly humorous and eerie style. Tone and Emotion: The emotional tone is unsettling and provocative, aiming to evoke a sense of unease and curiosity. Key Dialogue or Text: 'Suki the modeling robot just can't stop posing, and now she's available for purchase on the dark web's only robots store.' and 'her skin was made from the flesh of dead corpses.' Main Message: This video wants to tell us that the concept of a hyper-realistic modeling robot made from human flesh is a disturbing and satirical commentary on the commodification of human-like entities. Visual Composition: The video features a person in a white tank top and underwear posing in various ways against a textured wall with red lighting, creating a dramatic and eerie atmosphere."
  },
  {
    "video_id": "21",
    "text": "Happy Hour - A Crazy 3 minute retro review!",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/16wgyza/happy_hour_a_crazy_3_minute_retro_review/",
    "description": "1. The video is a short clip with a humorous and informative style, focusing on reviewing a video game.\n2. The tone is light-hearted and engaging, with a touch of nostalgia.\n3. The most prominent text is 'DO NOT SERVE THIS MAN,' which appears as a subtitle.\n4. This video wants to tell us that 'Happy Hour' is a simple yet enjoyable game with a unique blend of humor and retro aesthetics.\n5. The video features a person holding a glass, a group of people at a table, and various retro video game graphics, including a bar scene and a game interface."
  },
  {
    "video_id": "22",
    "text": "Womenareevil",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/16mhftt/womenareevil/",
    "description": "1. The video is a short clip with a humorous and provocative style, using sarcasm and stereotypes to create a comedic effect.\n2. The emotional tone is light-hearted and humorous, with a satirical approach to gender stereotypes.\n3. \"Women are evil.\"\n4. This video wants to tell us that women are inherently evil, using humor and stereotypes to convey this message.\n5. The video features a woman in a green coat, a group of women celebrating, a woman dancing, and a woman applying makeup, all set against various backgrounds."
  },
  {
    "video_id": "23",
    "text": "Why You Should Never Delete Social Media",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/14t9f6o/why_you_should_never_delete_social_media/",
    "description": "1. The video is a short clip with a serious and reflective tone, resembling a documentary style.\n2. The emotional tone is serious and contemplative, prompting viewers to reflect on their relationship with technology.\n3. The most prominent text is the question: 'Are you using technology, or is technology using you?'\n4. This video wants to tell us that technology has a significant impact on our lives, and we should be mindful of how we use it.\n5. The video features various people in different settings, including a picnic, a studio, and an office, engaging with technology in different ways."
  },
  {
    "video_id": "24",
    "text": "the sarcasm in this video is unreal",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/vozgag/the_sarcasm_in_this_video_is_unreal/",
    "description": "1. The video is a short, animated clip with a humorous style, featuring a series of quick, absurd scenes.\n2. The emotional tone is lighthearted and comedic, with elements of surprise and absurdity.\n3. The most prominent text is 'bruhinator,' which appears on a syringe-like object.\n4. This video wants to tell us that unexpected and bizarre events can be humorous.\n5. The video features simple, cartoonish characters with exaggerated features, engaging in various activities against plain backgrounds."
  },
  {
    "video_id": "25",
    "text": "Just as ordered!",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/uv421k/just_as_ordered/",
    "description": "1. Video Type and Style: This video is a short clip, likely part of a larger tutorial or demonstration, presented in a straightforward, instructional style.\n2. Tone and Emotion: The tone is neutral and informative, with no strong emotions conveyed.\n3. Key Dialogue or Text: The most prominent text is the order on the screen, which includes 'WATER' and '+LIGHT ICE' repeated multiple times.\n4. Main Message (Summary Sentence): This video wants to tell us that the machine is capable of dispensing water and light ice as per the order.\n5. Visual Composition: The main visual elements include a digital screen displaying an order, a control panel with numbered buttons, and a close-up of an ice dispenser filling a glass with ice."
  },
  {
    "video_id": "26",
    "text": "New so I read all the rules!",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/sfskwf/new_so_i_read_all_the_rules/",
    "description": "1. The video is a compilation of short clips with a satirical and critical style, using humor and memes to address political and social issues.\n2. The emotional tone is a mix of dark humor, skepticism, and criticism, often using exaggerated visuals and memes to convey a cynical perspective.\n3. Key dialogue or text includes phrases like 'This Week In Stupid,' 'Shame On Me,' and 'No cure for stupid,' emphasizing the satirical critique.\n4. This video wants to tell us that it is critiquing political figures and events with a focus on perceived foolishness and incompetence.\n5. The visual composition includes a mix of animated memes, real-life footage, and text overlays, often featuring political figures, symbols, and satirical imagery."
  },
  {
    "video_id": "27",
    "text": "Talibexas Anthem",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/pikk7e/talibexas_anthem/",
    "description": "1. The video is a short clip with a humorous and satirical style, resembling a social media post.\n2. The tone is light-hearted and sarcastic, using humor to address serious issues.\n3. Key dialogue: 'Ooooh Talibexas! 😊' and 'Yeah, we can't even run our own electricity 😜'\n4. This video wants to tell us that it mocks the idea of a new country called 'Talibexas' with exaggerated and absurd lyrics.\n5. The video features a man in a dark shirt with a pattern, holding a guitar, in a room with various decorations and paintings."
  },
  {
    "video_id": "28",
    "text": "SMH at the PGA. In an effort to get more viewers they now beam/highlight the exact path the ball needs to travel to the hole for the golfers. What a joke.",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/o4jd80/smh_at_the_pga_in_an_effort_to_get_more_viewers/",
    "description": "1. Video Type and Style: This video is a short clip, likely from a sports broadcast, focusing on a specific moment in a golf tournament. The style is realistic and straightforward, capturing the event as it unfolds.\n\n2. Tone and Emotion: The emotional tone is celebratory and triumphant, especially after the golfer makes the putt.\n\n3. Key Dialogue or Text: The most prominent text is the overlay that reads '2017 JON RAHM' and the on-screen graphic showing '60' 8\" MAKE PCT. 2%'.\n\n4. Main Message (Summary Sentence): This video wants to tell us that Jon Rahm successfully made a challenging putt during a golf tournament.\n\n5. Visual Composition: The main visual elements include a golfer in a red shirt and gray pants, preparing to putt on a green with a water hazard in the background. The camera follows the ball's trajectory towards the hole, and the scene transitions to the golfer celebrating with a fist pump and a hug from another person."
  },
  {
    "video_id": "29",
    "text": "These are resident cats at a vet. They sure are healthy, aren't they?",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/mqq7c3/these_are_resident_cats_at_a_vet_they_sure_are/",
    "description": "1. Video Type and Style: This video is a short clip featuring a humorous and light-hearted scene between two cats.\n2. Tone and Emotion: The emotional tone is playful and amusing, as the cats engage in a friendly tussle.\n3. Key Dialogue or Text: There is no dialogue or text in the video.\n4. Main Message (Summary Sentence): This video wants to tell us that cats can have fun and playful interactions.\n5. Visual Composition: The video shows two cats, one white and one light-colored, playfully wrestling on a green mat with a toy nearby, set against a wooden floor and a bench."
  },
  {
    "video_id": "30",
    "text": "The sarcasm is real. (Side note msw=scam period)",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/m0iulg/the_sarcasm_is_real_side_note_mswscam_period/",
    "description": "1. Video Type and Style: The video appears to be a short clip, possibly part of a larger interview or documentary, with a serious and reflective tone.\n2. Tone and Emotion: The emotional tone is serious and reflective, with a sense of urgency and concern.\n3. Key Dialogue or Text: The most prominent text is the call to action at the bottom of the screen, urging viewers to call or text for free miracle spring water.\n4. Main Message (Summary Sentence): This video wants to tell us that there is a need for clean water and that the organization is offering a solution.\n5. Visual Composition: The main visual elements include a person speaking on a television screen, with a call to action text at the bottom. The scene transitions to a dimly lit room where a person is seen moving around, possibly searching for something."
  },
  {
    "video_id": "31",
    "text": "New Follower",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/k0s514/new_follower/",
    "description": "1. Video Type and Style: The video is a short clip with a humorous and slightly unsettling style.\n2. Tone and Emotion: The tone is light-hearted but with an underlying sense of unease.\n3. Key Dialogue or Text: 'Cancer started following you.' (0:10)\n4. Main Message (Summary Sentence): This video wants to tell us that unexpected and potentially unwanted attention can come from anywhere, even metaphorically from a serious condition like cancer.\n5. Visual Composition: The video features a person sitting on a ledge overlooking a cityscape, with a clear blue sky and distant hills in the background. The person is wearing a pink beanie and a light blue denim jacket."
  },
  {
    "video_id": "32",
    "text": "[OC] - FADAM & FRIENDS Podcast - Sponsor - “FalseFlex”",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/jg1c42/oc_fadam_friends_podcast_sponsor_falseflex/",
    "description": "The video is a static image with a bold red and white text overlay that reads 'FalseFlex' at the top, followed by a subtitle stating 'A proven technique to demonstrate... DOMINANCE'. Below the text, there is an illustration of a pair of legs wearing blue pants and green sneakers. The background features a repeating pattern of the letters 'F' and 'F' in a stylized font, reminiscent of a luxury brand logo. The overall design suggests a promotional or instructional theme related to demonstrating dominance through a specific technique or product."
  },
  {
    "video_id": "33",
    "text": "How To Survive A Karen In Four Easy Steps",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/j5t7hi/how_to_survive_a_karen_in_four_easy_steps/",
    "description": "1. The video is a compilation of short clips with a humorous and slightly unsettling style.\n2. The emotional tone is a mix of light-hearted and tense, with elements of dark humor and absurdity.\n3. Key dialogue includes phrases like 'Yup something ain't right here' and 'If that happens again. Shoot me between the eyes. PLEASE!' \n4. This video wants to tell us that unexpected and bizarre events can occur in everyday life, often with humorous undertones.\n5. The video features a variety of visual elements, including coffee machines, people conversing, animals, and text overlays, all contributing to the comedic and unsettling atmosphere."
  },
  {
    "video_id": "34",
    "text": "FADAM & FRIENDS Podcast - Sponsor - “The Listeners Who Refuse to Follow Us on Instagram”",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/j3u3kd/fadam_friends_podcast_sponsor_the_listeners_who/",
    "description": "1. Video Type and Style: The video is a short clip with a humorous and exaggerated style, resembling a meme or social media post.\n2. Tone and Emotion: The emotional tone is light-hearted and humorous, using exaggerated expressions to convey a playful message.\n3. Key Dialogue or Text: 'THE LISTENERS WHO REFUSE TO FOLLOW US ON INSTAGRAM' and 'WE KNOW WHO YOU ARE, AND IT'S EXTREMELY HURTFUL TO US...' are the key texts displayed in the video.\n4. Main Message (Summary Sentence): This video wants to tell us that it humorously highlights the exaggerated reaction of content creators to followers not following them on Instagram.\n5. Visual Composition: The main visual element is an animated character with a displeased expression, holding a smartphone and looking at it with a frown. The background is a dark gradient, and the text is prominently displayed in bold, white letters."
  },
  {
    "video_id": "35",
    "text": "FADAM & FRIENDS PODCAST - E29 - Sponsor - “The One That Got Away”",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/imq8se/fadam_friends_podcast_e29_sponsor_the_one_that/",
    "description": "1. Video Type and Style: The video is a static image resembling a poster or advertisement with a retro, pop-art style.\n2. Tone and Emotion: The tone is bold and provocative, aiming to evoke strong emotions related to love and obsession.\n3. Key Dialogue or Text: 'THE ONE THAT GOT AWAY' is the most prominent text, followed by 'START FOLLOWING YOUR HEART TODAY!' in a starburst.\n4. Main Message (Summary Sentence): This video wants to tell us that love is a crazy and compelling force that can lead to unconventional choices.\n5. Visual Composition: The main visual element is a neon red heart with concentric outlines, overlaid with a crosshair, set against a black grid background."
  },
  {
    "video_id": "36",
    "text": "The struggle is real",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/ifrgl9/the_struggle_is_real/",
    "description": "1. The video is a compilation of short clips, likely from a humorous or satirical video, using a meme-like format to present a series of relatable and often unfortunate situations.\n2. The emotional tone is primarily humorous, using exaggerated reactions and everyday mishaps to evoke laughter and relatability.\n3. The most prominent text in the video is the recurring caption: 'IF YOU THINK OTHER RACES HAVE IT BAD TRY BEING WHITE'.\n4. This video wants to tell us that being white can be challenging and humorous in its own way, using a satirical approach to address racial stereotypes and everyday frustrations.\n5. The video features various people in different settings (kitchens, living rooms, outdoors) engaging in everyday activities that go wrong, such as spilling drinks, dropping eggs, and struggling with household chores."
  },
  {
    "video_id": "37",
    "text": "How to be happy",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/i3g7xl/how_to_be_happy/",
    "description": "1. The video is a short clip with a humorous and motivational style, resembling a self-help guide.\n2. The emotional tone is a mix of light-heartedness and seriousness, with elements of both motivation and dark humor.\n3. Key dialogue includes phrases like 'FAKE IT TIL YOU MAKE IT' and 'DO THINGS,' emphasizing action and social interaction.\n4. This video wants to tell us that happiness can be achieved through a series of steps involving self-action, social engagement, and personal connections.\n5. The visual composition includes various people in different settings (e.g., a man by the water, a person on a motorcycle, a man in a suit), engaging in activities that suggest action and socialization."
  },
  {
    "video_id": "38",
    "text": "Made this sarcastic ad offering 'white friendly' diversity services. Hope you guys like it :)",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/hu1v15/made_this_sarcastic_ad_offering_white_friendly/",
    "description": "1. The video is a short comedic clip featuring a young man delivering a satirical monologue. The style is humorous and exaggerated, using quick cuts and meme-like overlays to enhance the comedic effect.\n2. The emotional tone is light-hearted and satirical, poking fun at the concept of diversity quotas in filmmaking.\n3. Key dialogue includes phrases like 'Diversity on Demand' and 'I'll slap some diversity in there,' which are central to the comedic theme.\n4. This video wants to tell us that the pressure to include diversity in films can sometimes lead to superficial and clichéd representations.\n5. The visual composition includes the young man in various settings, such as a convenience store, a cab, and a bar, with different outfits and props to emphasize the different roles he humorously portrays."
  },
  {
    "video_id": "39",
    "text": "Wow! This Dance Is Classy & Motivational!",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/h0tpqt/wow_this_dance_is_classy_motivational/",
    "description": "1. Video Type and Style: This video is a short, vertical clip featuring a dance performance. The style is casual and energetic, typical of social media dance videos.\n\n2. Tone and Emotion: The emotional tone is lively and upbeat, aiming to be engaging and entertaining.\n\n3. Key Dialogue or Text: The most prominent text in the video is 'New dance alert'.\n\n4. Main Message (Summary Sentence): This video wants to tell us that there is a new dance routine to be aware of and possibly participate in.\n\n5. Visual Composition: The video features two individuals dancing in a room. The person in the foreground is wearing a white crop top and light blue shorts, while the person in the background is wearing a white tank top and gray pants. They are performing synchronized dance moves, and the background includes a closed door and a desk with various items on it."
  },
  {
    "video_id": "40",
    "text": "Annoying people on Instagram revealed with sarcastic honesty",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/faxt9f/annoying_people_on_instagram_revealed_with/",
    "description": "1. The video is a compilation of visually appealing scenes, likely intended to inspire or relax viewers. It has a non-narrative style, focusing on aesthetics rather than a structured story.\n2. The emotional tone is generally calm and serene, with moments of joy and curiosity.\n3. There is no specific dialogue or text that stands out as the central message.\n4. This video wants to tell us that beauty and tranquility can be found in everyday life and nature.\n5. The video features a variety of scenes including people interacting with technology, nature, and each other, as well as close-ups of food and animals. The settings range from indoor environments to outdoor landscapes."
  },
  {
    "video_id": "41",
    "text": "Mad Mike Hughes - Daredevil & Flat Earth Believer - Dies in Rocket Crash (Commentary by Rev. Damien)",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/sarcasm/comments/f9bogu/mad_mike_hughes_daredevil_flat_earth_believer/",
    "description": "1. The video is a short comedic clip featuring a puppet show with a satirical and humorous style.\n2. The emotional tone is light-hearted and absurd, with elements of dark humor.\n3. Key dialogue includes phrases like 'THE PREACHER' and 'SOULS TRANSFERS TO HELL AND HEAVEN - live feed'.\n4. This video wants to tell us that the puppet show is a satirical commentary on religion and media.\n5. The visual composition includes a puppet with exaggerated features, a church setting, and various humorous and absurd images and overlays."
  },
  {
    "video_id": "42",
    "text": "well well well",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/1f6i4he/well_well_well/",
    "description": "1. Video Type and Style: The video is a short clip from a social media platform, likely Reddit, showcasing a thread of comments. The style is neutral and straightforward, focusing on text content.\n2. Tone and Emotion: The tone is neutral, with a hint of humor due to the nature of the thread's title and the content of the comments.\n3. Key Dialogue or Text: The most prominent sentence is the thread title, 'What's your brutally honest review,' which sets the context for the comments.\n4. Main Message (Summary Sentence): This video wants to tell us that the thread has received significant engagement, with many comments being deleted or removed, possibly due to their content.\n5. Visual Composition: The video displays a series of comments on a dark background, with text in white and light gray. The comments are scrolled through, showing various states such as 'deleted' and 'removed.'"
  },
  {
    "video_id": "43",
    "text": "30 years ago.....",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/1bbdjqj/30_years_ago/",
    "description": "1. The video is a short clip from a C-SPAN broadcast, likely part of a longer interview or discussion. The style is serious and formal, typical of political or legal discourse.\n2. The emotional tone is tense and confrontational, with the speaker expressing frustration and anger.\n3. The most prominent sentence in the video is: 'I'm not going to put up with it. I'm not going to put up with it.' This is a direct quote from the speaker.\n4. This video wants to tell us that the speaker is unwilling to tolerate certain behaviors or actions, indicating a strong stance on a particular issue.\n5. The main visual elements include a man in a dark suit and red tie speaking at a podium with a microphone. The background is blurred but suggests an indoor setting, possibly a courtroom or legislative chamber. The C-SPAN logo is visible in the bottom left corner of the screen."
  },
  {
    "video_id": "44",
    "text": "hmmm",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/123zujn/hmmm/",
    "description": "1. Video Type and Style: The video is a short clip from a Minecraft gameplay session, presented in a casual and humorous style.\n2. Tone and Emotion: The tone is light-hearted and humorous, with a sense of relaxation and enjoyment.\n3. Key Dialogue or Text: The most prominent text in the video is 'this is my relax these days so relaxing,' which appears as subtitles.\n4. Main Message (Summary Sentence): This video wants to tell us that the player finds Minecraft to be a relaxing and enjoyable activity.\n5. Visual Composition: The video features a Minecraft character standing on a sandy beach with a pink pig, with various animals like cows, sheep, and chickens appearing around. The player character is holding a purple item, possibly a tool or weapon, and the background includes a calm sea and a clear sky."
  },
  {
    "video_id": "45",
    "text": "Came across some quality irony on IG today…",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/111q29t/came_across_some_quality_irony_on_ig_today/",
    "description": "1. The video is a short clip with a humorous and slightly cynical style.\n2. The emotional tone is light-hearted and humorous, with a hint of social commentary.\n3. The most prominent sentence in the video is: 'Eating food as an American is so depressing because everyday it's like 'did you know that thing you've been eating since you were 6 is a class 1 carcinogen and illegal in 87 countries'.'\n4. This video wants to tell us that the American diet can be surprisingly unhealthy and potentially harmful, with a humorous twist.\n5. The main visual elements include a Minecraft-like game environment with a player character navigating through a landscape, and a close-up of a hand interacting with various colorful candies on a table."
  },
  {
    "video_id": "46",
    "text": "WCGW wanted to jump",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/Irony/comments/10zwkz3/wcgw_wanted_to_jump/",
    "description": "1. Video Type and Style: This video is a short clip, likely a home recording, with a humorous and light-hearted style.\n2. Tone and Emotion: The emotional tone is playful and energetic, suggesting a fun and carefree moment.\n3. Key Dialogue or Text: There is no dialogue or text present in the video.\n4. Main Message (Summary Sentence): This video wants to tell us that even in the rain, children can find joy and entertainment.\n5. Visual Composition: The video features a child running down a wet street, holding a yellow object, with a residential neighborhood in the background. The child's movement is dynamic, and the wet pavement reflects the surroundings."
  },
  {
    "video_id": "47",
    "text": "Trump Fantasy Draft Advice for Travis Kelce",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/parody/comments/1f5yrlk/trump_fantasy_draft_advice_for_travis_kelce/",
    "description": "1. Video Type and Style: The video is a short clip, likely part of a larger interview or talk show segment, presented in a humorous and exaggerated style.\n2. Tone and Emotion: The emotional tone is light-hearted and comedic, with the speaker's exaggerated gestures and expressions contributing to a humorous atmosphere.\n3. Key Dialogue or Text: The most prominent sentence in the video is, \"I am the champion of the world.\"\n4. Main Message (Summary Sentence): This video wants to tell us that the speaker is humorously claiming to be the best in the world at something, possibly a game or activity, in a playful and exaggerated manner.\n5. Visual Composition: The main visual elements include a person with blonde hair wearing a patterned shirt, sitting at a desk with a championship belt, a microphone, a pair of sunglasses, and a bottle of what appears to be a beverage. The background features a world map and two decorative columns, adding to the comedic and grandiose presentation."
  },
  {
    "video_id": "48",
    "text": "Wunder Boner ( radio commercial ) Parody",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/parody/comments/1dj5oz4/wunder_boner_radio_commercial_parody/",
    "description": "The video is a static advertisement for the Wander Boner™, a fish bone removal tool. The style is straightforward and promotional, aiming to inform potential customers about the product's features and benefits. The tone is neutral and informative, focusing on the practical aspects of the tool. The key text in the video reads: 'Designed specifically for salmonid species of fish including trout, salmon, char and whitefish.' The main message of the video is that the Wander Boner™ is an efficient tool for removing fish bones from salmonid species quickly. The visual composition includes images of fish and the tool itself, with text highlighting its effectiveness and patent pending status."
  },
  {
    "video_id": "49",
    "text": "Material Mania (Parody video)",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/parody/comments/1bx8p81/material_mania_parody_video/",
    "description": "1. The video is a short, humorous clip with a playful and engaging style.\n2. The emotional tone is light-hearted and fun, with a focus on humor and surprise.\n3. The most prominent text is 'LOL! JK! This is often a parody. April Fools! XD'.\n4. This video wants to tell us that it's a playful parody for April Fools' Day.\n5. The visual composition includes close-ups of toy figures, a dollhouse, and a bright pink background, with a focus on the toys and their interactions."
  },
  {
    "video_id": "50",
    "text": "How We Do Parody",
    "label": "Sarcasm",
    "url": "https://www.reddit.com/r/parody/comments/1b1jblu/how_we_do_parody/",
    "description": "1. Video Type and Style: The video is a short clip styled as a humorous parody of a well-known song.\n2. Tone and Emotion: The emotional tone is light-hearted and comedic.\n3. Key Dialogue or Text: 'THIS IS HOW I POOP. I TAKE AN HOUR AND A HALF WHILE I'M SCROLLING ON MY PHONE. THIS IS HOW I POOP. IT'S KIND OF SAD BUT IT'S TRUE. MOST MEN GET ALONE. THIS IS HOW I POOP. I TAKE ANOTHER LAXATIVE, HOPEFULLY I CAN GO. THIS IS HOW I POOP. AND IF YOU'RE POOPIN' RIGHT NOW, I HOPE YOU GOT TP ROLLS!' \n4. Main Message (Summary Sentence): This video wants to tell us that the parody humorously describes a relatable and exaggerated routine of using the toilet.\n5. Visual Composition: The main visual elements include a person in a white hoodie and black beanie, with a colorful, abstract background. The person appears to be singing or speaking the parody lyrics."
  },
  {
    "video_id": "51",
    "text": "JB Pritzker loving his wife MK at the Illinois State Fairgrounds Expo Building",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1kgxv8k/jb_pritzker_loving_his_wife_mk_at_the_illinois/",
    "description": "1. Video Type and Style: This video is a short clip, likely part of a larger event or show, with a formal and celebratory style.\n2. Tone and Emotion: The emotional tone is positive and celebratory, with a focus on the joy of the occasion.\n3. Key Dialogue or Text: The most prominent text is the sign in the background that reads 'NATIONAL TV AWARDS 2014'.\n4. Main Message (Summary Sentence): This video wants to tell us that the National TV Awards 2014 is a significant and celebratory event.\n5. Visual Composition: The main visual elements include a man in a dark suit and a woman in a bright pink dress dancing closely, with a violinist and a man speaking into a microphone in the background."
  },
  {
    "video_id": "52",
    "text": "Even though we are apart... I would still do this for you in the end",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1iyhb2s/even_though_we_are_apart_i_would_still_do_this/",
    "description": "1. The video is a short clip with a humorous and satirical style, poking fun at Disney's Star Wars projects.\n2. The emotional tone is light-hearted and comedic, using exaggerated elements to create a humorous effect.\n3. The most prominent text is the overlay 'Better than anything Disney has done with Star Wars 😂'.\n4. This video wants to tell us that the creator believes their work is superior to Disney's Star Wars projects in a humorous way.\n5. The visual composition includes a person in a dark setting, a figure in a black uniform with a helmet, and a bright red and white light beam, all contributing to the comedic and satirical tone."
  },
  {
    "video_id": "53",
    "text": "Gamer love is... (built this in the game, will be updated with partner's name and sent to him today)",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1ip6wms/gamer_love_is_built_this_in_the_game_will_be/",
    "description": "1. Video Type and Style: The video is a short clip with a humorous and light-hearted style.\n2. Tone and Emotion: The emotional tone is playful and engaging.\n3. Key Dialogue or Text: The most prominent sentence is 'I am a Minecraft YouTuber, and I am here to show you my heart.' This is displayed as a subtitle.\n4. Main Message (Summary Sentence): This video wants to tell us that the creator is proud of their Minecraft creation and wants to share it with the audience.\n5. Visual Composition: The main visual elements include a large heart-shaped structure made of pink blocks in a Minecraft world, with a smaller circular structure connected by a line to the left, and a brown landmass to the right."
  },
  {
    "video_id": "54",
    "text": "a lil video of me and my fiance decorating our first Christmas tree together",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1hubj0e/a_lil_video_of_me_and_my_fiance_decorating_our/",
    "description": "1. Video Type and Style: This video is a short, humorous clip, likely part of a longer interview or behind-the-scenes footage. The style is casual and playful, with a focus on capturing a spontaneous moment between two friends.\n2. Tone and Emotion: The emotional tone is lighthearted and affectionate. The video conveys a sense of joy and camaraderie between the two individuals.\n3. Key Dialogue or Text: The most prominent sentence in the video is, 'I'm gonna hug you, man!' This line captures the essence of the moment and sets the stage for the affectionate interaction that follows.\n4. Main Message (Summary Sentence): This video wants to tell us that genuine affection and friendship can transcend traditional boundaries and expressions, even in a humorous context.\n5. Visual Composition: The main visual elements include two individuals in a cozy indoor setting, with a decorated Christmas tree in the background. The person with red hair is initially seated, while the person with blue hair stands and interacts with them. The actions are focused on the playful and affectionate exchange between the two, culminating in a warm hug."
  },
  {
    "video_id": "55",
    "text": "Love is my girlfriend stalking me through the house to attack my ticklish sides",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1aqj5fp/love_is_my_girlfriend_stalking_me_through_the/",
    "description": "1. Video Type and Style: This video is a short clip, likely part of a longer interview or documentary, presented in a serious and informative style.\n2. Tone and Emotion: The emotional tone is neutral and serious, focusing on delivering information about the woman's experience.\n3. Key Dialogue or Text: The most prominent sentence is, 'I was in the hospital for a week and a day, and I was released on Christmas Day of 2009.' This highlights the significant event of her release from the hospital.\n4. Main Message (Summary Sentence): This video wants to tell us that the woman had a significant health event that required hospitalization and recovery.\n5. Visual Composition: The main visual elements include a person in a dark top and pants standing in a room with a white tiled floor and a white toilet, suggesting a bathroom setting. The camera movement is shaky, indicating handheld recording."
  },
  {
    "video_id": "56",
    "text": "This is why balance is very important for long term relationship",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1akw0yc/this_is_why_balance_is_very_important_for_long/",
    "description": "1. Video Type and Style: This video is a short, animated clip with a minimalist style, using silhouettes and simple graphics to convey its message.\n2. Tone and Emotion: The emotional tone is neutral, bordering on contemplative, as it explores the concept of balance in relationships without leaning heavily on strong emotions.\n3. Key Dialogue or Text: The most prominent text is the phrase 'It's not about balance, it's about being on the same page,' which appears as a subtitle.\n4. Main Message (Summary Sentence): This video wants to tell us that a balanced relationship is not just about equal input but about mutual understanding and agreement.\n5. Visual Composition: The video features two silhouetted figures, a man and a woman, standing on opposite ends of a seesaw. Above their heads are icons representing their thoughts or desires, which change throughout the video to illustrate the concept of balance and understanding in a relationship."
  },
  {
    "video_id": "57",
    "text": "These kinds of videos get me excited about the idea of getting married to my boyfriend, even though I'm not usually into traditional things like marriage 🥺💓",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1kadlw4/these_kinds_of_videos_get_me_excited_about_the/",
    "description": "1. Video Type and Style: The video is a compilation of short clips, likely from a longer video or a series of videos, presented in a humorous and relatable style.\n2. Tone and Emotion: The emotional tone is lighthearted and humorous, focusing on the relatable feeling of nervousness and anxiety surrounding marriage.\n3. Key Dialogue or Text: The most prominent sentence in the video is the recurring subtitle, 'Marriage is scary. What if he doesn't react like this?'\n4. Main Message (Summary Sentence): This video wants to tell us that the nervousness and anxiety surrounding marriage are common and often exaggerated, but can also be humorous and endearing.\n5. Visual Composition: The main visual elements include men in formal attire, often crying or wiping away tears, set against various backgrounds that suggest wedding ceremonies or related events."
  },
  {
    "video_id": "58",
    "text": "guys omg i love my gf so much she mad this spotify playlist for me",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1jcz0up/guys_omg_i_love_my_gf_so_much_she_mad_this/",
    "description": "1. Video Type and Style: The video is a screenshot of a mobile music application interface, specifically a playlist titled 'hbf'. The style is straightforward and functional, focusing on the user interface of the app.\n2. Tone and Emotion: The tone is neutral and the emotion is content, as it is a static display of a music playlist without any dynamic elements or emotional cues.\n3. Key Dialogue or Text: There is no dialogue or text present in the video, as it is a visual representation of a playlist.\n4. Main Message (Summary Sentence): This video wants to tell us that the user has a playlist titled 'hbf' with various songs listed in it.\n5. Visual Composition: The main visual elements include the playlist title 'hbf', a list of songs with their respective artists and album covers, and the interface elements of the music application such as the play button, search bar, and navigation icons at the bottom."
  },
  {
    "video_id": "59",
    "text": "I made this cartoon for my girl friend. Do you think she’ll like it?",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1itlnup/i_made_this_cartoon_for_my_girl_friend_do_you/",
    "description": "Video Type and Style: This is a short animated clip with a humorous and whimsical style.Tone and Emotion: The tone is light-hearted and playful, with moments of surprise and affection. Key Dialogue or Text: \"Actually maybe I'm here for the soup.\" Main Message: This video wants to tell us that sometimes, what we initially claim to want may not be our true intention, and genuine feelings can emerge unexpectedly. Visual Composition: The video features two animated characters, an orange one with cat-like ears and a purple one with a ponytail. The orange character offers soup to the purple one, who initially claims to be there for the orange character, not the soup. The background is a light green stone wall, and the characters' expressions change from surprise to affection."
  },
  {
    "video_id": "60",
    "text": "I got engaged to the love of my life at the Ren Faire and i just want to tell everyone in the world, im so happy it feels like too much for my body to hold 💕",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1k5w982/i_got_engaged_to_the_love_of_my_life_at_the_ren/",
    "description": "1. Video Type and Style: This video is a short clip capturing a significant moment, likely a proposal, in a realistic and emotional style.\n2. Tone and Emotion: The emotional tone is joyful and celebratory, capturing a moment of happiness and commitment.\n3. Key Dialogue or Text: The most prominent sentence is the man's proposal, 'Will you be my wife?'\n4. Main Message (Summary Sentence): This video wants to tell us that love and commitment can be beautifully expressed in simple yet profound moments.\n5. Visual Composition: The video features a man kneeling and proposing to a woman by a lake, with mountains in the background. The woman is dressed in a black dress with a colorful sash, and the man is wearing a blue shirt and orange pants. The setting includes a wooden fence adorned with prayer flags, adding a cultural touch to the scene."
  },
  {
    "video_id": "61",
    "text": "Shania Twain - From This Moment On (Official Music Video). Happy Valentines to my love and all those who love!",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/111u3p1/shania_twain_from_this_moment_on_official_music/",
    "description": "1. The video is a short clip with a fashion and artistic style, focusing on the presentation of a dress.\n2. The emotional tone is neutral and elegant, emphasizing the beauty and design of the dress.\n3. The most prominent text is 'This is my dress. I designed it for you.' spoken by the woman.\n4. This video wants to tell us that the dress is a unique creation designed with care and attention to detail.\n5. The main visual elements include a woman in a white dress with a high collar, standing in a minimalist, white hallway. She adjusts her dress and poses to showcase its design."
  },
  {
    "video_id": "62",
    "text": "I love to love and to feel loved and there was so much love in this room!!! ✨💕✨",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1j36qfo/i_love_to_love_and_to_feel_loved_and_there_was_so/",
    "description": "1. The video is a short clip, likely from a live performance or concert, with a dynamic and energetic style.\n2. The emotional tone is lively and engaging, with a focus on the excitement of the performance.\n3. The most prominent text in the video is the word 'Blitz' displayed on the large screen behind the performer.\n4. This video wants to tell us that the performer is delivering an energetic and engaging live show.\n5. The main visual elements include a performer on stage, a large screen displaying 'Blitz,' and a crowd of people watching the performance."
  },
  {
    "video_id": "63",
    "text": "It is easy to let go but choosing to stay and make things work is hardest",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1hakxqa/it_is_easy_to_let_go_but_choosing_to_stay_and/",
    "description": "1. Video Type and Style: This video is a short clip with a contemplative and serene style.\n2. Tone and Emotion: The emotional tone is calm and introspective.\n3. Key Dialogue or Text: 'I don't know what future holds but I want you to stay.'\n4. Main Message (Summary Sentence): This video wants to tell us that the person values their relationship and hopes for its continuation despite uncertainty about the future.\n5. Visual Composition: The video features a person lying on a wooden bench on a balcony at night, overlooking a cityscape with string lights, creating a cozy and intimate atmosphere."
  },
  {
    "video_id": "64",
    "text": "Just asked my Bf to be my valentine via this song. (he said yes)",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1amy477/just_asked_my_bf_to_be_my_valentine_via_this_song/",
    "description": "1. Video Type and Style: The video is a static image with a clear and straightforward style, focusing on delivering a message rather than telling a story or presenting information in a dynamic way.\n2. Tone and Emotion: The tone is friendly and inviting, aiming to evoke feelings of love and affection associated with Valentine's Day.\n3. Key Dialogue or Text: The most prominent text in the video is 'BE MY VALENTINE'.\n4. Main Message (Summary Sentence): This video wants to tell us that it is a special occasion to express love and affection, encouraging viewers to be someone's Valentine.\n5. Visual Composition: The main visual elements include a white background with a string of red letters spelling out 'BE MY VALENTINE' and a row of hearts in various colors and textures below the text."
  },
  {
    "video_id": "65",
    "text": "My friend’s first anniversary with his ex boyfriend edit made by me",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/17sq9pj/my_friends_first_anniversary_with_his_ex/",
    "description": "1. Video Type and Style: The video is a short, personal clip with a narrative style, focusing on a romantic relationship.\n2. Tone and Emotion: The video conveys a light-hearted and affectionate tone, emphasizing love and commitment.\n3. Key Dialogue or Text: 'Us in a few years...' and 'Happy anniversary my cutie pie' are key phrases that highlight the video's message.\n4. Main Message (Summary Sentence): This video wants to tell us that love can grow and flourish over time, as shown by the couple's relationship.\n5. Visual Composition: The video features a couple in various settings, including indoors and outdoors, with affectionate gestures and messages displayed on screen."
  },
  {
    "video_id": "66",
    "text": "Wrote a love song (sort of) with my wife. We are amateurs. The video features AI visuals.",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/15nduho/wrote_a_love_song_sort_of_with_my_wife_we_are/",
    "description": "1. Video Type and Style: The video is a short, visually dynamic piece with a cosmic theme, likely serving as a visual accompaniment to a song or as a standalone artistic expression. The style is vibrant and abstract, focusing on the beauty of space.\n\n2. Tone and Emotion: The emotional tone is one of longing and need, conveyed through the lyrics and the vast, somewhat isolating visuals of space.\n\n3. Key Dialogue or Text: The most prominent text in the video is the repeated phrase \"Love to Love You Baby\" and \"I Need Your Love.\"\n\n4. Main Message (Summary Sentence): This video wants to tell us that the speaker is expressing a deep need for love and connection, using the metaphor of space to represent the vastness of their feelings.\n\n5. Visual Composition: The main visual elements include a variety of planets and celestial bodies floating in space, with a prominent rainbow-colored light beam running through the scene. The planets are diverse in size and color, and the background is a dark expanse dotted with stars and nebulae."
  },
  {
    "video_id": "67",
    "text": "It is 2049 and I'm living with my girlfriend, bringing her presents like this",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/15kx38n/it_is_2049_and_im_living_with_my_girlfriend/",
    "description": "1. The video is a short, futuristic narrative clip with a serious and contemplative tone.\n2. The emotional tone is tense and unsettling, with an underlying sense of unease and existential dread.\n3. Key dialogue: \"It's our anniversary.\"\n4. This video wants to tell us that the future can be isolating and emotionally charged, even with advanced technology.\n5. The video features a man interacting with a hologram of a woman, set in a futuristic environment with sleek, modern design elements."
  },
  {
    "video_id": "68",
    "text": "I made a little video about what I think love is after my long term girlfriend broke up with me",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/11etylp/i_made_a_little_video_about_what_i_think_love_is/",
    "description": "The video is a reflective and introspective piece, likely a short clip or a segment from a longer video, possibly a music video or a personal vlog. The style is serious and contemplative, focusing on the emotional journey of the individual. The emotional tone is somber and reflective, with a sense of introspection and acceptance. The key dialogue or text includes phrases like 'the misconception of love' and 'what love really is,' indicating a deep exploration of the concept of love. The main message of the video is that love is not a fairy tale but an intense subconscious loyalty and a constant work in progress. Visually, the video features a person playing an acoustic guitar, with close-up shots of the hands and the instrument, set against a blurred background, emphasizing the act of playing and the emotional weight of the music."
  },
  {
    "video_id": "69",
    "text": "The Science of Love: Uncovering the Biology and Psychology Behind Falling in Love | Mottos tv",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/10si664/the_science_of_love_uncovering_the_biology_and/",
    "description": "1. Video Type and Style: The video is a short, artistic montage with a contemplative and reflective style.\n2. Tone and Emotion: The emotional tone is serene and introspective, prompting viewers to ponder the nature of love.\n3. Key Dialogue or Text: 'What is love? It is the ultimate question.' This line encapsulates the video's central theme.\n4. Main Message (Summary Sentence): This video wants to tell us that love is a profound and universal human experience that transcends time and context.\n5. Visual Composition: The video features a series of artistic images, including intimate moments between couples, classical paintings, and modern scenes of astronauts, all exploring the multifaceted nature of love."
  },
  {
    "video_id": "70",
    "text": "Cliff Richard - I Love You [Undubbed version - Stereo] - 1960",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/10pn7rf/cliff_richard_i_love_you_undubbed_version_stereo/",
    "description": "1. Video Type and Style: The video is a compilation of various album covers and promotional materials related to Cliff Richard and The Shadows, presented in a non-narrative, montage style.\n2. Tone and Emotion: The video maintains a neutral and nostalgic tone, emphasizing the historical significance of the music.\n3. Key Dialogue or Text: The most prominent text is 'I LOVE YOU' by Cliff Richard and The Shadows, featured on multiple album covers.\n4. Main Message (Summary Sentence): This video wants to tell us that Cliff Richard and The Shadows have a rich history of popular music, highlighted by their hit song 'I Love You' and various album releases.\n5. Visual Composition: The video features a series of album covers, promotional images, and a black-and-white photograph of a band performing. The covers are colorful and prominently display the artist's name and song titles."
  },
  {
    "video_id": "71",
    "text": "My Favourite Photo of My Wife - and the Lessons I Learn from It",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1j926nr/my_favourite_photo_of_my_wife_and_the_lessons_i/",
    "description": "1. The video is a short, humorous clip with a lighthearted and affectionate tone.\n2. The emotional tone is light-hearted and humorous, with a touch of tenderness.\n3. The most prominent text in the video is the subtitle 'My Favourite Photo Of My Wife' displayed at the beginning.\n4. This video wants to tell us that the man has a deep affection for his wife and enjoys playful moments with her.\n5. The main visual elements include a man in a black t-shirt, a woman in a black motorcycle suit, a golden retriever, and various framed photographs on a wall. The setting is a cozy kitchen with a view of a garden through large windows."
  },
  {
    "video_id": "72",
    "text": "He wrote me a poem, I wrote him a song",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1ixqatf/he_wrote_me_a_poem_i_wrote_him_a_song/",
    "description": "1. Video Type and Style: The video is a short, artistic clip with a contemplative and poetic style.\n2. Tone and Emotion: The emotional tone is reflective and serene, with a touch of melancholy.\n3. Key Dialogue or Text: The most prominent text is 'lovers again,' suggesting a theme of reconnection or second chances.\n4. Main Message (Summary Sentence): This video wants to tell us that love and connection can be found again, even amidst loss and change.\n5. Visual Composition: The video features a woman in a white dress on a beach, interacting with a wooden chair and the ocean waves, with a focus on her movements and the natural setting."
  },
  {
    "video_id": "73",
    "text": "A beautiful story about a couple who relives their engagement every day",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1fi5vnc/a_beautiful_story_about_a_couple_who_relives/",
    "description": "1. The video is a short, reflective clip with a documentary-like style, focusing on a fisherman's routine.\n2. The tone is calm and nostalgic, evoking a sense of peaceful solitude.\n3. 'I've been doing this for longer than I can remember.' - This line encapsulates the fisherman's lifelong dedication.\n4. This video wants to tell us that the fisherman has a deep connection to his craft and the tranquility of nature.\n5. The video features an elderly fisherman in a small boat on a misty river, surrounded by lush greenery, with scenes of him preparing his fishing gear and enjoying the serene environment."
  },
  {
    "video_id": "74",
    "text": "Stocked bfs fridge so he could come home to a full fridge",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1fh8mtt/stocked_bfs_fridge_so_he_could_come_home_to_a/",
    "description": "1. Video Type and Style: This video is a short, humorous clip, likely a part of a social media post or a personal vlog.\n2. Tone and Emotion: The tone is light-hearted and relatable, expressing a sense of exhaustion and procrastination.\n3. Key Dialogue or Text: The text overlay reads, 'Okay I am too tired for anything else. I was supposed to do laundry,' accompanied by a skull emoji.\n4. Main Message (Summary Sentence): This video wants to tell us that even with daily responsibilities, fatigue can lead to procrastination.\n5. Visual Composition: The video shows a hand reaching into a refrigerator filled with various food items, then transitions to a cluttered desk with a mirror and a fan, suggesting a personal workspace."
  },
  {
    "video_id": "75",
    "text": "Groom learned Korean secretly to surprise his wife in the weeding",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1gajhuu/groom_learned_korean_secretly_to_surprise_his/",
    "description": "1. Video Type and Style: This video is a short clip, likely part of a larger wedding event or documentary. The style is formal and emotional, focusing on a heartfelt speech.\n2. Tone and Emotion: The emotional tone is serious and heartfelt, with a strong sense of gratitude and love.\n3. Key Dialogue or Text: 'I'm thankful you've accepted me as a new member of the family, and I promise to love and take care of Sohee forever.'\n4. Main Message (Summary Sentence): This video wants to tell us that the speaker is deeply grateful for being accepted into Sohee's family and is committed to loving and caring for her.\n5. Visual Composition: The video features a man in a blue suit giving a speech, with a woman in a white dress and a man in a gray suit with an orange tie seated at a table, listening attentively. The setting appears to be a formal event, possibly a wedding, with a warm and intimate atmosphere."
  },
  {
    "video_id": "76",
    "text": "Just want to take the time out to show some appreciation for my beautiful family 🤞🏾",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/love/comments/1cxi3az/just_want_to_take_the_time_out_to_show_some/",
    "description": "1. Video Type and Style: This video is a short clip with a humorous style, capturing a playful interaction between two individuals.\n2. Tone and Emotion: The emotional tone is light-hearted and playful, with a hint of mock frustration.\n3. Key Dialogue or Text: The most prominent sentence in the video is, 'You're my son, I'm your father, you can't do that to me.' This line is delivered in a humorous tone.\n4. Main Message (Summary Sentence): This video wants to tell us that even in a father-son relationship, playful teasing and mock frustration can occur, highlighting the close and humorous bond between them.\n5. Visual Composition: The main visual elements include two individuals lying on a grassy field. One person is wearing a light-colored shirt and blue jeans, while the other is wearing a yellow shirt and blue jeans. The person in the yellow shirt is playfully interacting with the person in the light-colored shirt, who appears to be mock-frustrated."
  },
  {
    "video_id": "77",
    "text": "At work there are these canal covers for cables. I love driving over them. A moment of joy.",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happy/comments/1knu31l/at_work_there_are_these_canal_covers_for_cables_i/",
    "description": "Video Type and Style: This is a short clip with a minimalist and straightforward style. Tone and Emotion: The emotional tone is neutral and calm, with no significant emotional cues. Key Dialogue or Text: There is no prominent dialogue or text in the video. Main Message: This video wants to tell us that a simple, steady perspective can provide a sense of calm and focus. Visual Composition: The main visual elements include the front view of a bicycle's handlebars and a metal rack, with a concrete surface and metal plates on the ground. The camera moves forward steadily, maintaining a consistent view of the path ahead."
  },
  {
    "video_id": "78",
    "text": "Happy mother's day to all moms, so very glad to finish this commisisoned drawing portrait for this awesome family :)",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happy/comments/1kjuhb5/happy_mothers_day_to_all_moms_so_very_glad_to/",
    "description": "1. The video is a short, humorous clip featuring a family photo session.\n2. The tone is light-hearted and playful, with a focus on the amusing dynamics of family interactions.\n3. The most prominent dialogue is the mother's comment, 'I think we're ready for the picture,' which captures the anticipation and readiness for the photo.\n4. This video wants to tell us that family photo sessions can be fun and unpredictable, with moments of chaos and joy.\n5. The visual composition includes a family sitting on a couch, with the parents and children interacting in a playful manner. The setting is a cozy living room with a colorful rug and a painting on the wall."
  },
  {
    "video_id": "79",
    "text": "This was a success for the group I volunteer with. A year ago, we helped the first of dozens of injured foreign military volunteers. This is Fred, who was in the International Legion and needed to return home after serious injury in Ukraine. He made it home and got the surgery he needed.",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/success/comments/130kyc7/this_was_a_success_for_the_group_i_volunteer_with/",
    "description": "1. The video is a short clip with a serious and urgent tone, resembling a public service announcement or a call to action.\n2. The emotional tone is tense and concerned, aiming to evoke empathy and a sense of urgency in the viewer.\n3. The most prominent text in the video is the call to action: 'DONATE AT SP4UKRAINE.ORG'.\n4. This video wants to tell us that Ukraine is facing a dire humanitarian crisis due to the war, and viewers are urged to donate to support those affected.\n5. The main visual elements include a man with a beard and a cap speaking directly to the camera, with a rural landscape in the background. The setting appears to be outdoors, with trees and a house visible."
  },
  {
    "video_id": "80",
    "text": "This is heart warming",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/caring/comments/lwwl30/this_is_heart_warming/",
    "description": "1. Video Type and Style: This video is a short clip with a documentary-like style, focusing on the care and revival of a nerve plant.\n2. Tone and Emotion: The tone is neutral and informative, with a touch of satisfaction and care.\n3. Key Dialogue or Text: The most prominent text in the video is 'Nerve plant revival'.\n4. Main Message (Summary Sentence): This video wants to tell us that with proper care and attention, a nerve plant can be revived and thrive.\n5. Visual Composition: The video features a close-up of a hand misting a nerve plant with water, surrounded by other green plants in a bright room with a window in the background."
  },
  {
    "video_id": "81",
    "text": "Brave man rescues swan stuck on highway",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/Compassion/comments/1iqd3sk/brave_man_rescues_swan_stuck_on_highway/",
    "description": "1. The video is a short clip with a humorous style.\n2. The emotional tone is light-hearted and amusing.\n3. The most prominent text is 'DUMPERT' displayed in the top left corner.\n4. This video wants to tell us that unexpected and humorous events can occur in everyday life.\n5. The main visual elements include a highway scene with a white swan walking in front of a car, various vehicles passing by, and a man in a dark jacket and gray pants walking across the highway."
  },
  {
    "video_id": "82",
    "text": "Sam showing his love",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/Compassion/comments/1ge0xpo/sam_showing_his_love/",
    "description": "1. Video Type and Style: This video is a short clip from an interview or talk show, presented in a documentary-like style. It focuses on a single interaction between two individuals, emphasizing emotional depth and authenticity.\n\n2. Tone and Emotion: The emotional tone is serious and heartfelt, with moments of vulnerability and genuine connection. The video evokes empathy and understanding from the viewer.\n\n3. Key Dialogue or Text: The most prominent sentence in the video is Sean Astin's emphatic statement, 'NOTHING! It fucking blows!' This captures the rawness of his feelings about severe depression.\n\n4. Main Message (Summary Sentence): This video wants to tell us that even amidst personal struggles, genuine human connection and support can offer comfort and hope.\n\n5. Visual Composition: The video features two individuals seated at a table, with a dark curtain in the background. The main focus is on Sean Astin, who is wearing a white cap and shirt, and is engaged in a conversation with another person. The setting is simple, directing attention to the emotional exchange between the two."
  },
  {
    "video_id": "83",
    "text": "\"do not scream\"",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/perfectlycutscreams/comments/13e45me/do_not_scream/",
    "description": "1. Video Type and Style: This video is a short clip, likely part of a longer video or a social media post, with a humorous and light-hearted style.\n2. Tone and Emotion: The emotional tone is lighthearted and humorous, with a sense of playful anticipation.\n3. Key Dialogue or Text: The most prominent sentence in the video is, 'The box says do not open until the last day okay so,' which sets up the comedic premise.\n4. Main Message (Summary Sentence): This video wants to tell us that even when faced with instructions to wait, curiosity and excitement can lead to breaking the rules in a humorous way.\n5. Visual Composition: The main visual elements include a woman standing in a classroom, a wooden stool with a pink cushion, a large screen displaying a computer interface, and a box that she is about to open. The setting is colorful and child-friendly, with educational materials and decorations."
  },
  {
    "video_id": "84",
    "text": "what a way to go",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/killedthecameraman/comments/114x13w/what_a_way_to_go/",
    "description": "1. Video Type and Style: This video is a short, humorous clip featuring a dog and a person. The style is light-hearted and playful.\n2. Tone and Emotion: The emotional tone is lighthearted and amusing, with a sense of fun and excitement.\n3. Key Dialogue or Text: The most prominent text in the video is the TikTok username '@notion3x' displayed on the screen.\n4. Main Message (Summary Sentence): This video wants to tell us that dogs can be playful and entertaining, especially when interacting with their owners.\n5. Visual Composition: The main visual elements include a black dog on a beige carpet, a person wearing blue jeans and black socks, and a wooden table with various items on it. The dog is seen moving around and interacting with the person's feet."
  },
  {
    "video_id": "85",
    "text": "ONE OF US",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/instantbarbarians/comments/veqh9k/one_of_us/",
    "description": "1. The video is a short clip with a humorous and light-hearted style.\n2. The emotional tone is cheerful and celebratory.\n3. The most prominent text is the initial caption: 'Bought a yellow hat thinking nothing of it....'\n4. This video wants to tell us that a simple purchase led to an unexpected and joyful shared experience.\n5. The video features a person in a yellow hat, a large crowd also wearing yellow hats, and a scenic outdoor setting with a stage and a clear sky."
  },
  {
    "video_id": "86",
    "text": "rip",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/killedthecameraman/comments/v50f3m/rip/",
    "description": "1. Video Type and Style: This video is a short, humorous clip, likely intended for social media.\n2. Tone and Emotion: The video conveys a light-hearted and amusing mood.\n3. Key Dialogue or Text: The most prominent text is 'THE BOX COMBO' and 'Crispy, juicy, golden tenders' on the chicken box.\n4. Main Message (Summary Sentence): This video wants to tell us that the chicken tenders are so appealing that even a dog can't resist them.\n5. Visual Composition: The video features a close-up of a chicken box, a hand opening it to reveal tenders, and a white dog looking at the camera with a curious expression."
  },
  {
    "video_id": "87",
    "text": "I found this critter crawling around my drive way. Looks like it needs help but I wouldn’t know where to begin. What is this buh?",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/whatsthisbug/comments/os7zrr/i_found_this_critter_crawling_around_my_drive_way/",
    "description": "1. Video Type and Style: This is a short, real-life video clip with a serious and tense mood.\n2. Tone and Emotion: The video conveys a sense of anxiety and fear.\n3. Key Dialogue or Text: The most prominent sentence is the narrator's exclamation, 'Oh my gosh, it's a tarantula!' \n4. Main Message (Summary Sentence): This video wants to tell us that encountering a tarantula can be a frightening experience.\n5. Visual Composition: The video shows a close-up of a tarantula on a cracked concrete surface, with a person's foot in the background."
  },
  {
    "video_id": "88",
    "text": "Diamond training for Hang Tough in a climbing gym",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/gladiatorsuk/comments/1ki9at2/diamond_training_for_hang_tough_in_a_climbing_gym/",
    "description": "1. Video Type and Style: This video is a short clip, likely part of a longer interview or documentary, presented in a serious and informative style.\n2. Tone and Emotion: The emotional tone is neutral and curious, with a focus on conveying information about the climber's experience.\n3. Key Dialogue or Text: 'I was just kind of hanging there, and I was like, 'Okay, this is fine. I'm just going to kind of hang here for a little bit and then I'll just kind of go back up again.''\n4. Main Message (Summary Sentence): This video wants to tell us that the climber had a moment of pause and reflection during a challenging climb, ultimately deciding to continue.\n5. Visual Composition: The video features a climber in a blue shirt and shorts, suspended by a rope in an indoor climbing gym with colorful walls and a high ceiling with skylights. The climber is seen hanging and then climbing upwards."
  },
  {
    "video_id": "89",
    "text": "This is fantastic",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1kn9pwq/this_is_fantastic/",
    "description": "1. Video Type and Style: This video is a short, humorous clip, likely part of a larger interview or social media post. The style is casual and light-hearted, focusing on a brief, funny interaction between two individuals.\n\n2. Tone and Emotion: The emotional tone is lighthearted and humorous. The video aims to evoke laughter and amusement through the playful banter and the absurdity of the situation.\n\n3. Key Dialogue or Text: The most prominent sentence in the video is, 'I'm not your problem, I'm your solution.'\n\n4. Main Message (Summary Sentence): This video wants to tell us that even in moments of confusion or frustration, a positive attitude and a sense of humor can turn a situation around.\n\n5. Visual Composition: The video features two individuals in a domestic setting, likely a living room. The seated individual is wearing a blue sweater and a green and yellow scarf with the word 'BRAZIL' on it, suggesting a connection to Brazil or a Brazilian event. The standing individual is dressed in a black t-shirt and glasses. The background includes a couch with patterned cushions and a floor lamp, indicating a cozy, homey environment. The interaction is centered around the use of smartphones, with both individuals holding devices and engaging in a playful exchange."
  },
  {
    "video_id": "90",
    "text": "88 year-old Dad reunited with his son 🫶🏻",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1kfrf4m/88_yearold_dad_reunited_with_his_son/",
    "description": "1. Video Type and Style: This video is a short clip, likely a part of a longer interview or documentary, presented in a realistic and emotional style.\n2. Tone and Emotion: The emotional tone is deeply affectionate and heartfelt, emphasizing a strong emotional connection between the two men.\n3. Key Dialogue or Text: The most prominent text is the watermark 'THE DAD' and 'via Julkin,' indicating the source of the video.\n4. Main Message (Summary Sentence): This video wants to tell us that a heartfelt reunion between two individuals can evoke strong emotions and highlight the importance of personal connections.\n5. Visual Composition: The main visual elements include two men embracing in a busy indoor setting, possibly an airport or a train station, with other people and a counter in the background."
  },
  {
    "video_id": "91",
    "text": "Dad reacts to his daughter winning 4 awards at school",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1jkdo8s/dad_reacts_to_his_daughter_winning_4_awards_at/",
    "description": "1. Video Type and Style: This video is a short, emotional clip, likely part of a larger interview or documentary. The style is serious and heartfelt, focusing on the man's personal story and feelings.\n2. Tone and Emotion: The emotional tone is deeply personal and proud, with a hint of sadness and reflection. The man's words and expressions convey a sense of accomplishment and love for his daughter.\n3. Key Dialogue or Text: 'Call me what y'all want. But I never expected my child to receive four awards. And I've never been a academic student. I never reached those heights before. Call me weak. Call me lame but I'm crying because I never thought that could come from me and I'm proud of my daughter. I'm proud. Of course I could cry in front of her face but I'm proud. I'm $@#%$ proud. Now I'm on my way to go get this bread for her.'\n4. Main Message (Summary Sentence): This video wants to tell us that even in the face of personal limitations, a father can feel immense pride in his daughter's achievements.\n5. Visual Composition: The video features a man with dreadlocks, wearing a blue shirt, sitting in a car. The background is blurred, focusing on his emotional expression. The lighting is natural, suggesting daytime."
  },
  {
    "video_id": "92",
    "text": "Telling his dad he just got signed by a Major League Baseball team",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1jjt1fd/telling_his_dad_he_just_got_signed_by_a_major/",
    "description": "1. The video is a short, real-life clip with a humorous and heartwarming style.\n2. The emotional tone is light-hearted and joyful.\n3. The most prominent sentence is, 'Surprising my dad at his work with the news that I just got signed by the Washington Nationals 🎉.'\n4. This video wants to tell us that a son surprised his father at work with the news of being signed by a professional baseball team, leading to a joyful and proud reaction.\n5. The main visual elements include a young man in a white t-shirt and red cap, an office setting with desks, computers, and a '90 YEARS NEW' poster, and the actions of walking, greeting, and embracing."
  },
  {
    "video_id": "93",
    "text": "Richard Dawson cried on his birthday when his son surprised him—looks like \"happy tears\" was the number one answer! (Anyone else remember watching this?)",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1jgh8lg/richard_dawson_cried_on_his_birthday_when_his_son/",
    "description": "1. The video is a short clip with a humorous and light-hearted style, resembling a comedic sketch or a celebratory moment on a television show.\n2. The emotional tone is joyful and celebratory, with a strong sense of camaraderie and affection between the characters.\n3. The most prominent sentence in the video is, 'I love you, Michael Landon, and I always have, and I always will, and I always will. I love you.' This is a heartfelt declaration of love and admiration.\n4. This video wants to tell us that there is a deep and genuine affection between the characters, highlighting a moment of emotional connection and celebration.\n5. The main visual elements include two men in formal attire, with one in a white suit and the other in a brown suit with a red flower on his lapel. The setting appears to be a stage with a festive background, possibly a television show set, and there are other people present, including a woman in a dark outfit and another man in a red and black striped suit holding a bouquet of flowers."
  },
  {
    "video_id": "94",
    "text": "new puppy dad ♥️🥹",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1izybz4/new_puppy_dad/",
    "description": "1. Video Type and Style: This video is a short, humorous clip, likely a part of a longer interview or casual conversation.\n2. Tone and Emotion: The video conveys a light-hearted and affectionate mood, emphasizing the bond between the man and his dog.\n3. Key Dialogue or Text: The most prominent sentence is, 'I love you so much, man. I do. I really do. I do..."
  },
  {
    "video_id": "95",
    "text": "Such a beautiful example of a father who clearly poured himself into raising his son, regardless of the genetics. ❤️",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1iqcd3x/such_a_beautiful_example_of_a_father_who_clearly/",
    "description": "1. Video Type and Style: This video is a short, emotional clip, likely part of a larger interview or documentary segment. It has a serious and heartfelt tone.\n2. Tone and Emotion: The video conveys a strong sense of love, pride, and emotional connection between the individuals.\n3. Key Dialogue or Text: 'Changed his last name to honor his step-father' and 'This is everything!' are the most prominent subtitles.\n4. Main Message (Summary Sentence): This video wants to tell us that personal gestures of love and respect, such as changing one's last name to honor a loved one, can deeply impact relationships and create lasting memories.\n5. Visual Composition: The video features a young man in a football jersey, an older man in a hat and sunglasses, and a woman in a black top. The setting appears to be indoors, possibly in a locker room or similar space. The main actions include the young man presenting his jersey and the older man embracing him, highlighting the emotional connection between them."
  },
  {
    "video_id": "96",
    "text": "Groom's daughter leaves him a message before she and her mom walk down the aisle 🥹",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1i49p06/grooms_daughter_leaves_him_a_message_before_she/",
    "description": "1. Video Type and Style: This video is a short, emotional clip likely from a wedding ceremony, presented in a realistic, documentary-like style.\n2. Tone and Emotion: The emotional tone is sentimental and heartfelt, focusing on the emotional connection between the groom and his father.\n3. Key Dialogue or Text: 'HELLO DADDY IT'S ME EVIE. I'M WALKING DOWN THE AISLE AND WILL SEE YOU NOW. BECAUSE YOU'RE GOING TO MARRY MY MUMMY AND SHE LOOKS BEAUTIFUL. I LIKE YOU WE LOVE YOU SO SO MUCH. TO THE MOON AND BACK. WE LOVE YOU LOTS AND LOTS LIKE JELLY TOES. SEE YOU IN A MINUTE. SEE YA I DON'T WANNA BE A. SEE YOU ALLIGATOR.' This dialogue is a touching message from the groom's daughter, Evie, expressing her love and excitement for the wedding day.\n4. Main Message (Summary Sentence): This video wants to tell us that the groom's daughter, Evie, is sending a loving and emotional message to her father on his wedding day, expressing her love and excitement for the occasion.\n5. Visual Composition: The video features a man in a black tuxedo with a white boutonniere, standing in a warmly lit indoor setting with white floral arrangements in the background. The man appears emotional, holding a tissue and wiping his eyes, suggesting he is moved by the heartfelt message he has received."
  },
  {
    "video_id": "97",
    "text": "The cry of a father who hears his baby is alive",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1i36k4x/the_cry_of_a_father_who_hears_his_baby_is_alive/",
    "description": "1. Video Type and Style: This video is a short clip, likely from a longer interview or documentary, presented in a serious and emotional style.\n2. Tone and Emotion: The emotional tone is deeply emotional and heartfelt, focusing on the raw feelings of the characters involved.\n3. Key Dialogue or Text: 'No mother deserves to lose a child at birth. The sound of the baby's cry after 6 long minutes gave me goose bumps 😭'\n4. Main Message (Summary Sentence): This video wants to tell us that the experience of hearing a baby's cry after a difficult birth is profoundly emotional and impactful for the parents.\n5. Visual Composition: The video features a woman in a blue top and glasses, a man in a light-colored shirt, and another woman in a white top. The setting appears to be indoors, possibly in a hospital or home, with the characters displaying emotional reactions to the birth of a baby."
  },
  {
    "video_id": "98",
    "text": "After 6 years living in the U.S, this bro came back to Brazil for his father’s birthday without telling nobody",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1i1kpr7/after_6_years_living_in_the_us_this_bro_came_back/",
    "description": "Video Type and Style: This is a short clip capturing a family gathering or reunion, with a warm and affectionate style. Tone and Emotion: The emotional tone is heartfelt and emotional, highlighting moments of affection and reunion. Key Dialogue or Text: The text 'PAGODE NAMO' appears in a pink circle at the bottom center of the frames, possibly indicating a watermark or logo. Main Message: This video wants to tell us that family reunions are filled with warmth, affection, and heartfelt moments. Visual Composition: The video features a group of people sitting closely together in a room with light-colored walls and wooden doors. A man in a black shirt and camouflage pants is seen interacting with others, including a young girl in a white shirt and a woman in a white top and light blue jeans. The man later embraces another man in a beige shirt, sharing a heartfelt hug."
  },
  {
    "video_id": "99",
    "text": "Got one for you!",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1hv3aua/got_one_for_you/",
    "description": "Video Type and Style: This is a short clip capturing an emotional reunion or farewell event, with a heartfelt and emotional style. Tone and Emotion: The emotional tone is deeply touching and emotional, highlighting moments of affection and connection. Key Dialogue or Text: There is no prominent dialogue or text in the video. Main Message: This video wants to tell us that reunions and farewells are filled with deep emotions and heartfelt connections. Visual Composition: The video features a large gathering of people, including individuals in military uniforms. A man in a light blue military uniform and cap is seen holding a baby in a striped shirt and embracing a woman with long brown hair. The background shows a crowd of people, some in military uniforms, and a building with a beige and brown facade under a partly cloudy sky."
  },
  {
    "video_id": "100",
    "text": "Dad gifted his best friend's record collection 40 years after losing him",
    "label": "non-sarcastic",
    "url": "https://www.reddit.com/r/happycryingdads/comments/1hp7vew/dad_gifted_his_best_friends_record_collection_40/",
    "description": "Video Type and Style: This is a heartfelt short clip capturing a touching family moment during Christmas, with a warm and emotional style. Tone and Emotion: The emotional tone is deeply touching and emotional, highlighting moments of affection, gratitude, and connection. Key Dialogue or Text: The most prominent text is 'POV: you make your daddy's Christmas' and '40 years ago my dad lost his best friend in a car accident.' Another key text is 'All he wanted for Christmas was used records for a new record player' and 'I'm so thankful to be able to do this for him.' Main Message: This video wants to tell us that fulfilling a loved one's cherished wish can bring deep emotional satisfaction and gratitude. Visual Composition: The video features a woman in white pajamas holding a stack of records, standing in a cozy living room with a staircase and a baby gate in the background. She approaches a man in a red sweater sitting on a couch, who appears emotional. Two children in white pajamas are also present, interacting with the man and the records. The room is decorated with a Christmas tree and various gifts, creating a warm and festive atmosphere."
  }
]